[
  {
    "author": "Mahmut Çağdaş Durmazoğlu, 2008",
    "keywords": " rain drop analysis, agent based systems, decision support systems",
    "summary": "The aim of this thesis is to explain that an agent based system tool – in the sense of a program component – can help designers in the free-form shape generation by analysing and evaluating the form in digital media. The main issue about developing a program component, that is capable of assisting designers in free-form shape generation, is defining the problem domain that tool will be used. The problem domain, which the tool would be affective against, was decided by examining the difficulties within the design domain, such as difficulties concerning the structural components, materials and the form finding process, the research which is explained in this paper only focuses on the difficulties concerning the form finding process of the free-form design. The digital tool “DROP” was developed and used to exhibit the ways that an agent based tool could be used to assist designers for free-form shape generation and evaluation. The outcome of this thesis can be used to specify novel ways to determine the applicability of the form of the free-form architectural designs. ",
    "supervisor": "Prof. Dr. Gülen Çağdaş",
    "title": "An agent-based system tool to assist designers for free-form shape generation: DROP"
  },
  {
    "author": "Ayşe Duran, 2003",
    "keywords": "",
    "summary": "Novelties brought by the age of informatics are being used in architecture frequently. These are usually in the form of softwares supporting two-dimensional drawings, three dimensional modelling, animation and generation of sound and displays. But, softwares used in computer media do not support design sufficiently. Using case based systems is the next logical step. Recently, case-based reasoning and design has been taken into consideration in architecture also. Case-based design in architecture will become an important and useful part of all design systems in the future. Therefore, cased-based reasoning and design systems and their importance in architecture have been examined. Initially, cases, the general structure of case-based systems, the process of forming the case-base, its phases and how they can be carried out, have been shown. Then, the importance of case-based reasoning and design in architecture has been explained. This study also covers some case-based design systems which have been developed with various aims and which have taken place in the literature. CADRE, SEED, \"Generic Representations - Office Building\", \"Type Representations - Unite d' Habitation\" and other works on case based reasoning and design have been examined. Forming a case library on housing samples having specific typological characteristics, developing an index to support design by classifying and representing cases and to aid design have been aimed. Initially, the formation process and phases of the case-base have been explained theoretically. Then, cases have been represented according to their various characteristics and prepared to be indexed. Structural, unstructural, visual and textual representations of cases to be included in the case-base are made. It is supposed that the case-base and case library will expand as new cases are added in the course of time. xn\u000bThe system to be formed as a result of this research is an interactive system, aiding architectural design. It supports reasoning, forming new solutions and evaluation. The new problem is specified by the designer-user, precedents from the case-base in the system are retrieved, matched and chosen. Adaptation is made on the chosen case in accordance with specified contraints. The newly formed case is evaluated and presented to the user. Or, the user may return to the former steps of the system. Considering the wide interest in housing and flourishing business in the sector, a case-based system that can be used in housing is proposed. Case-based systems which are products of high technology, are introduced by using cases of this building type. Especially in designs of housing companies, it has been aimed that precedents and cases of the same typology are re-used by changing and developing them. The case based reasoning and design system should be so designed that it can be used by both professional designers and student-designers. The visual and textual information can be used by companies, house-owners, real estate dealers as well as designers. ",
    "supervisor": "Prof. Dr. Gülen Çağdaş",
    "title": "Case-based reasoning and architechtural design"
  },
  {
    "author": "Fatma Zeynep Gürbüz, 2009",
    "keywords": " responsive architecture, architectural space, architectural form, architectural material, information technology",
    "summary": "On the basis of advancing technologies, outputs and the described surroundings of Responsive Architectures can be commonly used in any type of building due to its functionality, comfortableness, flexibility, environmentalism and affordability. In this context, Responsive Architectures can shift architectural design philosophy, architectural design process and the roles in this process; moreover it can change the environment which we live in. In the thesis, it is pointed out what Responsive Architecture means, how it can be designed, how it can be implemented and how it can sustain. In order to answer these questions in a correct way, first, Responsive Architecture has been examined over literature studies. Then, it has been interpreted according to the given examples and the advancing technologies. Moreover, its processes of design and implementation have been defined and Responsive Architectures’ design and implementation process have been compared to the traditional design and implementation process. Finally, the future of the described surrounding of Responsive Architectures has been discussed. ",
    "supervisor": "Prof. Dr. Gülen Çağdaş",
    "title": "Future projections for responsive architecture"
  },
  {
    "author": "Ebru Ulu, 2009",
    "keywords": " shape grammers, islamic art, islamic star geometries, islamic geometric patterns",
    "summary": "This study is considering the shape grammars of the polygons and poly-pointed star patterns, evaluating the special features of pentagons and decagons in Islamic art, aiming generation of new patterns that have the similar characteristics of the geometric patterns in Islam with help of an expert system. In this context, it is given the structures and generation of the Islamic geometries and a design template is developed for new generated patterns. The shape grammar model, presented to get the results quickly and easily, developed the substructure of an expert system, which will be designed and built in the future. This study helps to realize that different final products can be formed from the shapes, which have the same design language and same initial shape applying the same rule schema. It is clarified that a design can be handled in a wider perspective in the context of shape grammars and reproduced by new designs with same genetic features.",
    "supervisor": "Assoc. Prof. Dr. Sinan Mert Şener",
    "title": "A shape grammar model to generate islamic geometric pattern"
  },
  {
    "author": "Özge Güngör, 2010 ",
    "keywords": " mass customization, evolutionary approaches, genetic algorithms, housing design",
    "summary": "For housing being shaped according to the users preferences a tool which will reflect all the preferences is needed between the user and the architect so a mass customization oriented model has been designed in the context of this thesis. First of all with the intervention of user interface, the user enters the housing type and room like preferences the same way with the data entry. In the model, according to the data obtained by the users, among numerous room options chooses the ones that suit with the user preferences and permits them to proliferate and at the same time eliminates the non suitable ones, the nature inspired evolutionary approach Genetic Algorithms are used in the generation of form and floor plans. After obtaining the housing different floors plans and the three dimensional images of the generated mass are giving users the opportunity to experience the place. The created model can be transformed in an additional software program to two and three dimensional programs so that the user orientated design data can be transferred through a file to the architect. Besides, the model can be developed in the future so that it can use different angles and curves to allow more flexible designs. ",
    "supervisor": "Prof. Dr. Gülen Çağdaş",
    "title": "A mass customızatıon oriented housing design model based on genetic algorithm"
  },
  {
    "author": "Faruk Can Ünal, 2013",
    "keywords": " augmented reality, architecture guide",
    "summary": "Technological advances have created virtual living space, as well as having a place in every aspect of people’s life. Today, virtuality is leaving its place to mixed form of reality and virtuality. In information technology, this link between virtuality and reality is presented people as Augmented Reality. Many people use the technology that we have been using via mobile application in our daily life for years but its Augmented Reality name was not known. Adoption and understanding of what the technology is by people that use it is important for continuity of developments. There have been many studies on Augmented Reality in both hardware and software areas. Despite all the efforts, still there are some limitations, but they are expected to be overcome in time. The advances in Augmented Reality technology enabled the emergence of many applications in the field of architecture as well as in other areas and now there are many applications having distinctive features related to the field architecture. In this study, main purpose is to examine recent developments in Augmented Reality technology, and to explore the possibilities of their use in the creation of a new architecture guide. To achieve this purpose, recent advances in hardware and software in the field of Augmented Reality are analyzed and their reflections in the field of architecture are evaluated through examples. With reference to the general features of architecture guides, it is focused on how to improve Augmented Reality. In the light of all these studies, ARc-G Architectural Guide is formed as recommendation. Today, architectural guidelines are presented through two different mediums, which are print and digital, and they contain data parallel to each other. It is indicated that digital guides, but not printed ones, offer convenience of directing how to find location of selected structure and wide range of scanning options. However, it is found that they are lack of functions providing route for all structures, defining this route in a certain time or creating new routes depending users’ interests. It is observed that it is required an interactive application to overcome these inefficiencies. Furthermore, today’s architecture guides that in use presents rigid data, but should they be adequate? There are data that may be included into system and enrich it. It is thought that presentation of structures’ virtual data in 3-D will be indispensable part of the system in near future. ARc-G Architectural Guide is a model constructed in a way generally applicable to all cities. Assessment of thesis research was made according to working principles of application that was run for Eindhoven city. This city became subject of interest because its potentials offered us multi-faceted evaluation. The model was manually examined based on the data of the city s transport and architecture. In the route selection, it is sought that route suggestions offered by the model can be interfered with, depending on personal and scanning options. In model route, new routes were created based on user’s personal interests such as adding and removing structures, defining user’s own route, using a route depending on time. In case of route presentation based on scanning options, scanning was formed with the parameters of construction style, architect and construction category that connects each other. Then, it was continued as the examination of the model through the city and sampling presentation of AG technology based on the route. It is showed that besides standard information of scale of the building, 3-D presentation of functional, structural and aesthetic features that cannot be found in an ordianary architecture guide can be achieved. Model enables easiness for observing architectural structuring in the city and providing instant data based on location, with support of 3 dimensional data from architectural structures’ database. In addition, people’s architectural trends can be realised through feedback from the model or structural data visited by them. In this way, while system will reveal user’s personal architectural structure profile and widespread interests in architectural structures and styles. ARc-G Architectural Guide model should not only be considered as a re-creation based on today s technology architecture guidelines. It should also be considered that this would support architecture tourism developed recently. At this point, alternative architectural tour routes and presentation of more data at the same time in an interactive environment gain importance. With reference of ARc-G Architectural Guide that was examined in the study, development of application was tried to be enriched. ",
    "supervisor": "Lec. Dr. Hakan Tong",
    "title": "Use of augmented reality technologies in architectural guide: the evaluation on Eindhoven City "
  },
  {
    "author": "Mehmet Ümit Meterelliyoz, 2010",
    "keywords": " cinema and architecture, Ridley Scott, science fiction",
    "summary": "In this paper; while dealing with the cooperation of cinema with architecture, we have followed Ridley Scott, one of the important directors today. Ridley Scott’s architectural activity is questioned, his cinema has tried to be analysed in terms of design through the images and the places he has used. What kind of spatial items Ridley Scott used in his works and how these images were presented to the audience forms the body of this thesis. the locations used in Ridley Scott films which is the subject of this study, the place and the design in parallel with the selected films have been analysed through subtexts connected to these places. At the end of the research, the films in Ridley Scott cinema have been classified by analyzing their spatial features in chronological order. the transformation in his films in the last 30 years during which he has actively played a role has been considered to be the use of the atmosphere the director formed, the methods used in set designs and the place- camera relation.",
    "supervisor": "Prof. Dr. Arzu Erdem",
    "title": "Space use in Ridley Scott cinematography"
  },
  {
    "author": "Sibel Duru, 2006",
    "keywords": " virtual architectural design studio, design education, learning models",
    "summary": "The methods, models and techniques that applied in architectural design education havebeen changed continuously by the development of the information and thecommunication technology. This situation causes the emergence of virtual design studios.Traditional architectural design studios and virtual design studios have been comparedin the comprehension of the thesis. The problems have been tried to be answered aboutwhat we can do for realizing effective architectural design studios in design educationand how virtual design studios should be. The recent cases of virtual design studios havebeen examined in accordance with differences and similarities between traditional andvirtual design studios. With the results of these examples, what teachers? roles will beand how participation of students will affected by the new form of the architecturaldesign studios have been evaluated, when design studios move to computer supportedcollaborative environments.Learning models that employed in virtual architectural design education, andopportunities, pedagogical benefits and difficulties of these models have been identified.In addition, the pedagogical approaches defended by important theoreticians have beenused as resource. Subjects and conditions that should be considered for providingpedagogical success in virtual design studio practice have been stated. In this way,future of architectural design education will be directed to more constructive andhelpful directions by the information and communication technology. ",
    "supervisor": "Prof. Dr. Gülen Çağdaş",
    "title": "Pedagogical approaches in virtual architectural design studio"
  },
  {
    "author": "Ayşegül Kurtoğlu, 2010 ",
    "keywords": " biomimetic architecture, social interaction, swarm intelligence, campus design",
    "summary": "In this study, after examining the concept of swarm intelligence which is an important part of nature and applications that have been developed as a result of this, a number of traces have been found relating to increasing social interaction in university campuses. Stigmergy , which is the most evident of these traces, namely action director concept is a kind of indirect communication tool which performs in social ant colonies. As a result of the examination within this study conducted for increasing social and intellectual level of the campus, user effect on forming traditional campus design principles and models has not been seen very much. So that it has been thought to bring the interaction to the forefront to reinforce the phenomenon of socialization with more stylistic methods. Depending on all of these, it has been found out within this recently developed model proposition that the concept of action director can be used for the purposes of coming up with designs with high interaction level that are produced by users in campuses or evaluating campuses",
    "supervisor": "Lec. Dr. Hakan Tong",
    "title": "The assessment of social interaction with stigmergy in campus design"
  },
  {
    "author": "Müge Çakır, 2006",
    "keywords": " modern form generation techniques, form generation techniques, information technologies and form, computer technologies and form",
    "summary": "In this study, effects of computer and information technologies on architecture, forms and form generation processes are defined and contemporary form generation techniques are researched. These techniques come from information, processed in computer technologies in various ways. So, these are not only seen as tools for form generations but also as a process in architectural design conception. The aim is to specify what research techniques are, determine the relations between them and investigate the form process continuum in this information age. In this content, form generation techniques are explained in five headlines and branches, with example projects and workshops, which are investigated in details on its form generation techniques. A table which is called, form generation techniques comparative table, is drawn to specify the relations of those techniques with each other, differentiations and similar aspects of the techniques in the process. The whole information, tables and diagrams explained in the four sections are reevaluated in the last section and some presumptions for the architecture and architect in the information age and form generation techniques are made. As a conclusion of the research, what important is that not the emerged form itself but the emerging process of the form in the form generation techniques of this Information Age.The formations of those processes are bounded to enthusiastic architects who are in continuous development and endeavor, looking for the unexplored.The future of the numerously increasing “blobby” forms generated with the form generated techniques may end up with a new architectural movement: Neo-Techno-Modern.",
    "supervisor": "Assist. Prof. Dr. Meltem Aksoy",
    "title": "Emergent form generation techniques that developing by information technologies"
  },
  {
    "author": "Alev Özdemir, 2012",
    "keywords": " performance arts, augmented reality, theatre, theatre architecture, stage",
    "summary": "The study proposes use of augmented reality technology for staging theatre and all kinds of performing arts. In this context, first evolution of theatre architecture and change of staging concept through history is studied. Augmented reality technology is introduced and examples of augmented reality projects in arts and in architecture are given. A staging component is proposed, evaluated with today’s means by examining current examples and studies. These examples are used for determining new fields of use in stage design and potential innovations in staging performance with the use of proposed component. Possible effects on theatre architecture, performance staging and society’s perception of theatre art are set forth. The study states lackings and potentials of the staging component, and proposes new study fields for a future application. ",
    "supervisor": "Assist. Prof. Dr. Yüksel Demir",
    "title": "Evaluating augmented reality technology as a staging component"
  },
  {
    "author": "Azize Melis Aybar, 2008",
    "keywords": " information space, digital space, computational design, digital design, time based information processing",
    "summary": "The aim of this research is; to investigate the effects on the action of architecture and design, while data, information and knowledge are being processed in the digital environment. Also to analyse how the architecture and design object transforms and how much it can develop dependent on the information processing. In this context, the concepts of data, information and knowledge, the environment and spaces in which the information is processed digitally, the process of information processing in design and the related approaches are being examined under the title of the fundamental concepts related to information processing. In the conclusion of the research by stating the specifications and transformations -related with the factors of time, space, motion and interactivity- of the sample design objects are being classified. The effects of digital information processing on the architecture and design object are being evaluated over this classification. ",
    "supervisor": "Assist. Prof. Dr. Meltem Aksoy",
    "title": "The effects of digital information processing over the architecture and design object"
  },
  {
    "author": "Tuğba Sare Çepni, 2004",
    "keywords": "",
    "summary": "Architectural design is a complex process during which the designer has to fullfill all the technical and aesthetic requirements in order to develop a successful solution. A designer can choose to achieve a solution to the design problem alone but the common way to satisfy all the criterias of the design problem is to collaborate and interact with other designers, people from different proffessions, suppliers, manufacturers and the client. With the development of communication, information and CAD technologies, today it is possible to represent design using digital tools, sharing it with other participants and have their opinions regardless of place and time. The aim of this study is to consider group work in design studios from different aspects and to design a virtual design studio that provides a collaborative environment with effective interaction and sharing of design information. In the second part the design process is examined from different approaches such as the individual approach, group approach and team approach. While the individual approach is about the designer's way of first defining and then finding a solution to the design problem alone, the group approach defines the design as a product that is developed with many ideas working in harmony. When there are many designers with different ideas trying to compromise, there are also many factors that can increase the effectiveness of the group work as well as that can spoil all the harmony. Team approach is necessary especially when the construction period is included in the design process. The designers have to work in teams with the experts from different proffessions in order to solve all the technical problems of the architectural design. The most important part of the architectural education is design studios and today the representation of the design alternatives by using the information technology is one of the major subjects in the design studios. In the third part of this study the different design studios and the network technology to find and share design knowledge and digital design media that is used to represent design are touched upon. Altough in traditional design studios these technologies are used in the least way possible, in digital design studios the students ability to use the information technology in order to represent design in the most efficient way is important. Other than representing the design, sharing it with other students and have discussions about it by using the network tecnology is the difference of the virtual design studios from the digital and traditional studios. In a virtual environment, communication becomes the central aspect of the design process. The fourth part consists of the ways to communicate in a virtual environment differing according to place and time. The selection of the tools and models of communication that is used for discussing, documenting and sharing the Vll<br> design decisions change the quality of interaction among the users determining the success of the virtual environment. Also in this part there are examples of the virtual environments designed for different purposes using different communication tools and models. The design of the interface that meet the needs of the users is considered in the fifth part. User interface design is important as well as the function of the application with the way in which it provides that functionality. If the user is not happy while using the interface, the application will also be used less until another interface is designed that satisfies the users needs. User interface design is essential for the hypermedia applications including different types of media in one document. Also in this part there are three software programs that is used for the design of the user interfaces for various purposes. TeamFace that is introduced in the sixth part of this study is a proposal for a collaborative environment for the students from different parts of the world to design and share their design knowledge in a virtual design studio. In this studio students can interact with others whenever they want, can draw sketches with other participants on an electronic whiteboard and they can also present their designs in this area. The result part is the evaluation of the previous parts and the proposed model, TeamFace Vlll ",
    "supervisor": "Prof. Dr. Gülen Çağdaş",
    "title": "A collaborative environment proposal for the virtual design studio"
  },
  {
    "author": "Rana Erbay, 2004",
    "keywords": "",
    "summary": "The rapidly increasing amount of information and narrowing but deepening information fields of the new Information Era may only be met with the developing communication and computer technologies. In relation to these technological developments, which are unified as Information Technologies, everyday life and scientific studies have been changing direction and the new requirements of the changing society have been strengthening the economic and strategic importance of the studies in this newly defined field. Although it has been late a little bit, these developments have lately been coming forth in the education area. The new educational strategies, developed by the governments and institutions, are based upon the fact that: a real renovation in education will only be possible by taking the advantage of all possibilities of the new technologies. On the other hand, in recent studies on education and the concept of \"efficiency\" in education, a viewpoint, focusing on the \"learner\", is being accepted widespread. It is stated that: in order to realize efficient learning: the learner must feel himself responsible and relaxed at the same time; have his own authority; and be motivated, in the learning environment. So that, in addition to learning, the possibility to improve personal capacities and intuitions will be supplied for the learner. Following the mentioned developments, the field of architectural design has been bidimensionally changing, including changes and rapid development in the field knowledge and the changes in storage and transfer of this information. The aim of this study is to develop a model for the application of the new educational strategies, within the context of education of architectural knowledge. As a result of the studies on architectural information, which necessitates the union of information of several disciplines; and the design behavior, which is not suitable for systematization: it is commonly accepted that: visual analogy and research on example projects play an important role in the transfer of architectural information and in design process. In xm\u000bthis context, the idea of providing an informal and continuously updated source, for architectural history and design education, has been the departure point of this study. In order to realize that, a system is proposed, with the aim of: the ease of transfer of information as well as its storage; motivation; the learner's development of his own learning strategy; rapid, easy and attractive information retrieval. A visual database application including visual and textual documents, which is accessed through internet, is developed. So that, an educational environment from which, the students of architecture and architects, may benefit for a specific research or a general tour among the overall records, is provided. The model is developed with the File Maker Pro 7 software, and is published on the web by using the internal publishing services within the same software. The model is composed of buildings, architects, images, comments, dictionary and help modules. Information exchange and free circulation among the modules is provided. The system user may perform queries; view query results all together in lists or one by one in forms; sort the records according to the chosen criteria and reach the secondary information in other modules, about any record. By now, limited information from architectural history resources is added to the system as a test group and the development of the system with the addition of other records is intentionally left to be done after the test publishing period. The model has been changed and developed according to the guidance of the test users during the development period. However, it will be more efficient and effective with the developments, based on the future feedback which will be taken from the users during the test publishing period. ",
    "supervisor": "Prof. Dr. Sinan Mert Şener",
    "title": "An educational database model for architects"
  },
  {
    "author": "Abdulkadir Eren Öztürk, 2013",
    "keywords": " architecture, design, mem, memetic, biosythesim, digital networks, visual",
    "summary": "In this study pictorial-turn of the information of design object in digital networks is seen as the last step of the variation-selection-inheritance process, which started by the replicator molecules, created organic livings and continued with culture. Symbiotic connections between organic forms, cultural artifact, design and cultural information space tried to be formed. After organic evolution is mentioned briefly to cover necessary terms and theories, parallel studies about cultural evolution are abstracted. 20th century design is overviewed considering the theorical background which eventually named as biocenrism, created by biological thought and evolutionary theories of the time. After the backtracking of Spencarian and Lamarckian cultural evolution theories which dominated the field in 20th century is touched on, the subject is shifted to memetics as a modern, genetics beased cultural evolution thery. In the frame of memetic research, the transformation of the information about artifact and it s design in digital networks is studied. Replicator is a term that defines beings which are able to create an identical copy of itself when some certain conditions are met, with or without the help of a secondary system. First known replicators are molecules which are prone to go through chemical reactions which as an end product will repeat the same moleculer pattern. As the premeval soup created the suitable conditions for the molecular replicators to multiply, culture can be said be the suitable medium for cultural replicators, which Dawkins names as memes (Dawkins, 1979). Memes which first appeared as ideas and behaviours which get imitated by other individuals and thus spread to other minds, at some point got transfered to the human artifacts. These artifacts which imbued whit replicative cultural information are informational entities. They can as well be perceived as extensions of organic form of man to his environment (Salingaros, 2007). Memes which populate the information space of the artifact are thus: informational agents which shape the way man interacts with his environment. In the last century of human history invent of digital networks created an autonomous virtual space. Digital networks proved to be a fertile replication medium for the memes which until then only inhabited human minds and artifacts (Salingaros, 2007). The main aspects necessary for survival success of replicators are replication speed, lifetime and copying fidelity. Digital networks proved to be enhancing for all these factors. Contemporary design is mainly depended on the information space created by digital networks and digital visions of artifacts are replicating faster than of physical ones. While the physical existance of the artifact is relatively stabil, it can be said that virtual representations of it are alive on to so called networks. At leas to a degree, it won t be wrong to state that the success of design is dependent on the replicative success of its virtual, informational representations: memes on the digital network. xvi In a memetical point of view, what is replicating, spreading and inherited to the next artifacts are the memes which have highest fitness in the environment created by digital networks. The information form which fits this definition the best is visual information. The fact that the information in digital networks is mainly coded as images can be related with the pictorial-turn theory of Mithcell. Richard Rorty explains the history of philosophy as a series of turns, of which the lingual turn is the last step. Mitchell on the other hand (with pioneers such as Charles Peirce with his Semiotics, Nelson Goodman with his Languages of Art and Ludwig Wittgenstein), explains another step of turn which is not lingual, and dominated by symbols and visual meaning. What is being represented , or designed directly on the digital netwroks are patterns of visual-memes. Memes which change their selective environment, and thusly their form of existense from physical to visual, is freed from the restrictions of the physical environment. ",
    "supervisor": "Assist.Prof.Dr. Meltem Aksoy",
    "title": "Memetical change of cultural artifact, pictorial turn in digital networks "
  },
  {
    "author": "Cem Topçu, 2012",
    "keywords": " cinema, science-fiction, computer aided science fiction, urban space, Gotham City, Batman",
    "summary": "This study investigates, the urban form, urban space and urban life style concepts in science fiction cinema, in the context of technological developments effect on formation of cinematic space. Some main concepts about science fiction genre, are defined at the beginning of the study. Then a broad literature research has been made about the technological developments in production design and its effects on creating the urban environment of science fiction cinema. This literature research has been supported by a chronological case study on different science fiction cinema examples. The study continues with the main example’s “Batman’s Gotham City” investigation. In this context, urban space representation of Gotham City in the comic books, cinema and computer games are analysed both in macro and micro scale. According to the case of study the research continues with effects of production technologies development on the releation of architecture and urban space on science fiction genre, and has predictions about future fiction and real-life cities. ",
    "supervisor": "Lec. Dr. Hakan Tong",
    "title": "Urban space in computer aided science fiction cinema: Gotham City case study"
  },
  {
    "author": "Emre Cestel, 2008",
    "keywords": " computer aided design, L-Systems, biomimetics, tall building design",
    "summary": "At the scope of this study, intersections of the nature and the design concepts are being questioned and the inspirations of the architectural design as process and form are being discussed. At the light of the process inspirations by nature, the concept of evolutionary design is being examined and its relation in different form and media is being utilized. The generative design approach which takes form by addition of computational sciences is being examined. At this point, as a generative algorithm, using Lindenmayer systems in the process of architectural design is being discussed. development of high-rise buildings in the history and design criterions are being analyzed and by means of this information, formal variations of tall buildings with the developments in technology are being discussed. This research examines the use of computer aided architectural design in the design process of tall buildings by the way of generative and innovative methods. Lastly, the model is being introduced where Lindermayer Systems, as a nature inspired generative system is being used in the conceptional design of high-rise buildings. ",
    "supervisor": "Prof.Dr. Gülen Çağdaş",
    "title": "Generative approaches at the conceptual design process of tall buildings"
  },
  {
    "author": "Nizamettin Hakan Yardım, 2007",
    "keywords": " cyberspace, interaction, virtuality",
    "summary": "We are entered into a new age, a digital age. Technological developments and science-fiction caused that new ideas are involved into the architectural discourse and into the theory of architecture because those were always an impulsive factor for our imagination. Developments in computer technologies caused to come out new approaches with new frontiers in the architectural process and in discourse. The term “interactivity” became the main idea behind the digital age of architecture since 1980’s. The new contemporary architectural discourse is introducing a new understanding of space, reality and experience. Today, architecture is thought to be a cross-section of different disciplines. Some of those can be assumed as architecture, engineering, IT (information technology) expertising, digital painting and designing, and users. Architecture in this new age is much more interactive and it allows also users to cooperate during the design process. This is mostly noticeable in cyberspace architecture, which still waits for further explorations. This new territory’s possibilities are not fully understood or explored. However, frontiers like Marcos Novak are introducing us the first steps. As a fusion of art, information and technology, architecture evolved itself into an upper stage: TransArchitecture. As “architecture beyond architecture”, TransArchitecture is searching the visible aspects in cyberspace in potentially fantastic forms. Within cyberspace, this aspect is taking on the form of a purely virtual topology of connectivity and interactivity. As cyberspace itself is architecture, it embraces TransArchitecture for oncoming developments. ",
    "supervisor": "Assoc.Prof.Dr. Arzu Erdem",
    "title": "An architectural approach to cyberspace: transarchitecture"
  },
  {
    "author": "Çağın Özbaki, 2009 ",
    "keywords": "early architectural design, geometric constraints",
    "summary": "The early design stage is an important part of the design process where most critical design decisions are taken, concepts are developed and improved. It is very crucial for the designers to consistently represent the design knowledge especially when there is a limited time for the early design phase. Since computational tools have been used increasingly in architectural design, they can also be utilized in the preliminary design phase. The design process can be more productive when the design environment remains the same. The building mass and plot contraints by the construction legislation constitute the design inputs for the preliminary design. In this study, a computational model is proposed due to the İstanbul Construction Legislation for generating an architectural design set up. The main objective is to define plot layout and geometrical set up in order to generate possible architectural solutions. The plot and the design set up criterias have to be selected or entered to be able to constitute the model. The compatibility of the declared design input and the algorithm is checked on its accuracy. Enhancing the preliminary design phase by using computational modeling opportunities creates new architectural design approaches, responding to the complexity of the current build environment. ",
    "supervisor": "Prof.Dr. Gülen Çağdaş",
    "title": "A constraint based computational model for generating an architectural design set up"
  },
  {
    "author": "Elçin Kara, 2006",
    "keywords": " basic design, basic design education, visual memory, database",
    "summary": "This study aims to improve a database model to support basic design lecture which is indispensable for the architectural design education. The model will be used to store information in order to interact with students in the electronic space using multimedia technologies. The main object of the study is to develop an interactive and dynamic database that support basic design studio electronically. The study will be formed in five chapters according to its aim. In the introduction chapter, the aim and the content of the project will take part. In the second section, information in the electronic media, interactivity, dinamism and multimedia will be searched. Also databases will be researched with their structures and advantages. In the third section, the basic design studio and its contents in the architectural curriculum will be studied. Bauhaus education which is accepted as the starting point of basic design education will be searched with its curriculum, objectives and the influences on today s design education. In addition to these, contemporary approaches will be researhed through national and international design schools. In the fourth chapter, the database model assisting basic design education will take part. The model will support different kinds of media students can research, visualize, interact and update. In the fifth chapter, the model will be evaluated and future proposals will take part. ",
    "supervisor": "Assoc.Prof.Dr. Arzu Erdem",
    "title": "A database proposal supporting basic design education"
  },
  {
    "author": "Şehnaz Cenani, 2007",
    "keywords": " artificial intelligence, agents, agent based simulation, mall, user movement",
    "summary": "The scope of this study is to analyze relationships of users and spatial configurations using agent-based simulation systems, under certain circumstances in a virtual environment with agents that represent users of a shopping mall with agent-based model developed in this research. In this study, exposing the dynamics of user-space relationship will help both students in architectural design education and professionals in practice, to observe and solve the design problems before the construction of shopping malls. This research can help designers to think about the users of buildings and to incorporate users’ needs in the design phase more than ever. The utilization area of the agent-based model is the early design phase of design, before the application phase but no later than completing the entire design decisions. High and low user density areas of shopping malls can be observed by this simulation. In this way, poor locations (low user areas), rich locations (high user areas), problem areas which limit users’ movements and do not cover high user rates can be determined and modifications can be made before the construction phase. Today, because most of the shopping malls are built without these kinds of preliminary studies, users encounter different problems on disaster situations and even on regular days. This model will help designers to design more efficient interior organizations. ",
    "supervisor": "Prof.Dr. Gülen Çağdaş",
    "title": "Representation of user movements by agent-based systems: mall design"
  },
  {
    "author": "Beyza Kasapoğlu, 2002",
    "keywords": "",
    "summary": "In architectural design process, designer sketches to develop his/her ideas and reflects his/her thoughts. Sketch has an interactive role in computing the ideas in memory, meanings in the depictions and defined thoughts, finding out new forms and adapting them to the design. In researches of design by traditional methods sketch holds an important place. By the improvements of technolofy and computers being included in design process. Researchers examing the design have started their studies towards sketches in computing. A group of researchers have taken sketch as an image and others are studying on simulation. The improvement of architectural design process in computing has been observed in this thesis. The designer's video and depictions that he/she has created in computer was recorded in studio. These records were investigated by protocol analysis of the designer's thinking systematic in architectural design computing process. By the results of analysis, the similarity and difference of architectural design computing and traditional design were put forward.\u000b ",
    "supervisor": "Prof. Dr. Gülen Çağdaş",
    "title": "Sketching in architectural design computing"
  },
  {
    "author": "Ayşegül Gönenç, 2004",
    "keywords": "",
    "summary": "VIRTUAL ARCHITECTURAL DATABASE: I.T.U SLIDE LIBRARY PROJECT The subject of our study is keeping Istanbul Technical University's architectural slide library in electronic environment. The slide library, which is taken from Architectural Department teachers, is defined to be used by students and teachers on internet or intranet technologies. Before starting our study, visual architectural database examples and technological systems used for database applications are searched in detail. The basic point of our study is making database systems. After defining our purpose on this study in introduction part, the description and historical improving of database systems subjects are defined in the second chapter. The improvement in database system software is for giving answers for the user's studies and requirements. In our study, Microsoft Access database program is used. But for making relational database tables and managing database system properly, the logic of database system working subject was studied in detail in the third chapter. Basic data models, normalization and the algorithm of searching and arranging are described in this chapter. If the security and management of database system can not be provided perfectly, the system will slow down and not be able to answer the user's requirements. And after a period, the slide library will not be able to work properly. This result may cost much in money, in time and in effort. After composing a database system, a team work is needed to improve and control its work. The subject of the fourth chapter is managing database systems.Using database systems in architecture, design and presentation phase, first architectural database applications show way to our study on architectural slide library. In chapter five, the relation between database systems and architecture is defined. In chapter six, the examples of digital architectural database systems, used nowadays, are described in detail with screenshots from web pages. The details of slide library database application, prepared as a visual database system model, are showed in chapter seven. The periods of database design and the technologies used for software are described in detail. This chapter gives information for our study on visual slide library by giving screenshots from our project's interface. The benefits of transferring the slide library into a digital database and the usage of new software technologies in architecture are summarized in the result part.",
    "supervisor": "Assoc.Prof.Dr. Sinan Mert Şener",
    "title": "Visual database model – İ.T.Ü. slide library"
  },
  {
    "author": "Ayşegül Kıdık, 2010 ",
    "keywords": " cyborg architecture, cube movie series",
    "summary": "By technogical development, architecture gains a new format, in this way,it is meaned on diffirent fields, different spaces and different sciences. The architecture does not only develop and update itself, also developes and updates its means and aims.The science of cybernetics changes format of architecture like artifical intelligence, mechatronic and robotic. Cyborg means that the common life of machines and organisms. As if, in cyborg architecture, architecture is a subject which is fiction of common life structure, machine and organism. Cyborg architecture thinking as, it can continue its own life, develop, regenerate, having limited thinking; being in interaction with user and its environment; target not only satisfy standart physical neccesarries, have a techonogical body, occur from common life of human-machine-nature. This thesis is prepared for have questioned and appericated cyborg architecture’s aim, place, time and being how. ",
    "supervisor": "Lec.Dr. Hakan Tong",
    "title": "Cyborg architecture"
  },
  {
    "author": "Özde Özdal, 2015",
    "keywords": "",
    "summary": "",
    "supervisor": "",
    "title": "Embodied Interaction: a Case for Playful Learning"
  },
  {
    "author": "Afshin Memari, 2011",
    "keywords": " multiple agent based systems, artificial intelligence",
    "summary": "While developing nations are intensifying their research on physical health programs, it is observed that, with the increase at the level of development, government departments becomes more concentrated on psychiatric health programs. Nowadays, in many countries, extensive research and tests concerning either design criterias or clinic management models are in progress. During the design process of psychiatric clinics, a large number of possibilities arise due to the repetitive arrangement of the patient rooms. In the stage of the evaluation and selection of these possibilities, advantages of the usage of computational design methods emerges either in time saving or in scanning a larger area of possibilities. At this point, it is envisioned that the design problem, with its repetitive structure, is appropriate for the application of few rules to many rooms; agents representing the rooms are used for developing a design methodology.In this context after giving general information about psychiatric clinics, worldwide examples of psychiatry models and the approach changes in the therapy trends and clinic units are introduced, principles and key design criterias of clinic design are explained.In this thesis the agent based method developed for the clinic design is explained; then possibilities to be base for module and clinic design are generated and evaluated.Then an example simulation model for the circulation of the pre-defined user (patient) -represented by agents- in the product clinic schemas are interrogated, in this way, the tests and form studies of the schemas are supported. ",
    "supervisor": "Lec.Dr. Hakan Tong",
    "title": "An agent based algorithm proposal in the development process of psychiatric clinic plan schemes"
  },
  {
    "author": "Ahmet Emre Dinçer, 2008",
    "keywords": "",
    "summary": "In this study it was aimed to develop a module for teaching design principles and basic concepts to new-beginners of design education as well as to raise their interest in digital media tools and provide their interactivity in the early period through this auxiliary interface developed using scripts of a 3D modeling software. Accordingly, developing the software “EduDesign”, made up of different modules (stick composer, shell and surface deformations, making composition, color organizations…), different solutions were examined. After testing phase by different users, the modules were revised according to the feedbacks. Consequently, while it was generally paid attention to consistence of the enhanced software applications with the pre-defined aims, the positive reactions coming from users and their evaluations and suggestions for future works, the work was approved for its aims and emphasized to be open-ended. ",
    "supervisor": "Lec.Dr. Hakan Tong",
    "title": "An interatıve interface proposal for 3d (three dimensional) basic design implementations"
  },
  {
    "author": "Suzan Girginkaya, 2006",
    "keywords": "multiuser virtual space, interaction, movement models in museums",
    "summary": "The goal of this thesis is to analyse ‘the varying movement models observed in multi user virtual environments according to the interaction between users and the extend to which these models resemble the models in the real world.’ In this scope, the procedure to be followed will be the examination of movement models occurring in the real space and virtual simulation of Topkapı Museum Treasury Section with obsevational and analytic methods and the comparison of the two distinct data sets gathered. Concerning these findings, the advantages that can be provided to the users by the transition of real space to the virtual environment are accentuated. For future suggestions, it is indicated that in the evolution of the virtual architecture, the human factor should be taken into consideration along with architectural features. Besides the it is emphasized that the current publicity of our cultural heritages are rather poor and in order to improve this situation the necessity to benefit from three dimensional and multi user virtual environments is discussed. ",
    "supervisor": "Prof.Dr. Gülen Çağdaş",
    "title": "Testing the simulation of the real world movement models with movement models in virtual environments"
  },
  {
    "author": "İbrahim Halil Canseven, 2003",
    "keywords": "",
    "summary": "As the whole world, great changes occurs in Turkey because of the the rapidly growing structure of information technologies. These are social, personal and organizational changes. Design is a complex and collaborative process. At the same time design is a social action that people reflect their backgrounds and their different dimensions to design requirements. In this period it's thought that searching the impacts and defining the possibilites of information technologies on architectural issues is very important. Accordingly the developments on information technolojies are told the in the first part of this thesis. The developments on information technology begins with the developments of computer systems. By the being easily acquired, becoming more flexible and widespread acceptance of computer sytems obtained different departments in a firm to access each other. That constituded a trend which revealed the effectiveness of the installation of data systems In general the effects of information technology is classified in 5 parts: the moving focus to individual, transformation of data to information, human-computer interaction, demolition of centralised control ideas and the developments of knowledge based organizations. In chapter 3 the effects and the contributions of information technology on architectural issues is told. In general these effects can be classified in four parts: the effects on architectural space, effects on architectural design, effects on architectural workspace and effects on architectural organizations. The substitution of new methods supported by information technology for traditional methods caused effects on architectural space like the changes of spatial requirements. The effects on architectural design can be summarized as the possibilities and the difficulties that can be met on use. In the part effects on architectural workspace'' organizational and individual changes within office caused by the new technology. The effects on architectural organizations is based on the changes of decision making process within the office. XIII<br> In chapter 4 the concept of virtual design studios is told. Design is a complex and a collaborative process. Rarely a design problem can be solved by the designer without interaction of the other designers, clients, experts of other diciplines, suppliers, etc. Traditional design studios are the places that designers work as an individual or a part of a team where the required resources and tools can be found by the project process. Commonly it can be told that the virtual design studios and traditional studios are very similar. The word virtual expresses that the action occurs in the unreal electronic environment. As traditional studios, a space or an environment is required in virtual design studios but it can only be reached by computers and somewhere on the net. Moreover, it's possible to access to the environment by any computer having capabilities of net, the location is unimportant. Accordingly, virtual design studios can be defined as a space that designer work individually or as a part of team without locations! restrictions. Virtual design studio environments are divided into two: distributed virtual design studio environment and centralised virtual design studio environment. In distributed virtual design studios each of the nodes contains several tools to work within the node. Integration depends on a group of appropriate tools to obtain information flow from one node to another. The distributed virtual design studios are generally divided into two: loosely coupled virtual design studios and tightly integrated virtual design studios. The centralised virtual design studio environments are maintained with a group of tools to support the data and to meet the communication needs of the nodes by the coordination of the central server within the nodes. That type of environments work with the paradigm of client/server and are free from the platforms. The functionality of this newly grown environment is limited with the internet protocols and web metafor. If s technological infrastructure allows high level of customization and easy adaptation in virtual design studio environment. The centralised virtual design studios are divided into two metaphors: the desktop metaphor and the place metaphor. In chapter 5 tightly integrated virtual design studios are told. It contains integrated tools for design, text and image processing, communication, scheduling and information management. In this environment, the harmony between the objects and their equivalent tools automatize the information management based on the collaboration. The infrastructure of the technology depends on platforms. That creates difficulties to apply it to the existing systems. That problem can be solved by a careful selection and the arrangements on components. xiv<br> The tightly integrated virtual design studios are researched in four topics: integration agreements and interface design, management and collaboration, communication and collaboration, handling project information, library support and currency. In chapter 6 the application possibilities and the difficulties of virtual design studios in architectural offices. The use of computer support for collaborative design is in its first phase. There is a long way for integration of information and communication between systems with different configurations of computers, softwares and hardware. Generally there are two types of communication difficulties in virtual design studios: difficulties caused by the environment and social difficulties. Chapter 7 is based on an area work containing a questionaire and the evaluation of that questionaire. The questionaire is hold within the managers of firms that have tendencies to use the information technology. In this questionaire the participants are asked for the tools that they use and their purposes for using these tools. In chapter 8 conclusion part takes place and contains evaluation of the study and the present condition in Turkey. ",
    "supervisor": "Prof.Dr. Gülen Çağdaş",
    "title": "Application possibilities of communication and collabration in virtual environment in architectural offices"
  },
  {
    "author": "Behiç Can Aldemir, 2014",
    "keywords": " biomimetics, L-systems, parametric design, generative systems",
    "summary": "In order to solve the problems experienced throughout the history of mankind the nature has always been seen as a guide. In the past hundreds of years technological capabilities and design approaches of architects have been drastically changed, but yet the biggest change is about to be realized in the current period. In this thesis, generative approaches to building shell formation based on natural processes are explored. Aim is to create a generative system model that responds to designer needs while utilising coherent variables. Design variations created by the proposed generative system offer conceptial products thay may guide the architect for fully integrated design. Firstly the design approaches with emphasis on the concept of biomimicry have been investigated. Biomimicrys approaches to architectural design on different levels are discussed. Later Lindenmayer systems, which are very successful at imitating natural processes of plant growth are explored as a generative system. The next chapter is based on generative systems produced by mimicing natural processes that introduced to the building design, especially determining the facade/shell design. In the last section, the generative models which are based on Lindenmayer systems are introduced. The developed models are explained with the help of algorithm diagrams, which make the variables and constants easier to understand and to show how they are related. In the last part the generative models developed in the previous part of the study and the designer experiences with the generative system have been analyzed. Successful and weak points of the models are discussed. ",
    "supervisor": "Prof.Dr. Sinan Mert Şener",
    "title": "Generative approaches to building shell formation based on natural processes"
  },
  {
    "author": "Serkan Yetkin, 2011",
    "keywords": " computational design tools, design process, form finding, open-source",
    "summary": "Innovations in the Information Technology change and transform the design process. Designer who meets the new possibilities of digital design explores them and recasts these tools to fit his or her requirements and habits. The effect of digital design tools in the design process is not only seen on speed and automatization of processes. New concepts or ideas that could not be applied because of lack of possibilities come to the fore with the aid of digital design tools. Designer should internalize the tools, so, he or she should explore the potential power of them. It is the key factor to have a grasp of creative design process. In the introduction part; aim, content and the methodologies of the thesis are paraphrased. In the second part of the study; discourses on form changing with digital design process and the concept of form-finding before and after the age of digital design are researched. In the third section; arguments for how computer is taking part as a tool and medium in design process are included. In the fourth part, the study presents the digital design tools and the processes in the context of how they diversify the design process, how they move the concept of form finding to another dimension and how they differentiate the design process. The inferences are classified in the titles of NURBS modeling, animation, scripting, visual programming and data translation. As a conclusion of the research in the fifth section; open-source tools and concepts are presented as new trends in information technology and design. New forms of architecture created with the aid of the digital design tools are probed in the context of two important exhibitions. In addition, the new roles for designers in the digital age of architecture are another result of this thesis study. ",
    "supervisor": "Assist.Prof.Dr. Meltem Aksoy",
    "title": "Digital design tools: a research in the context of design process"
  },
  {
    "author": "Abdullah Sencer Deren, 2006",
    "keywords": " virtual enviroment, cultural heritage, computation, situation analysis",
    "summary": "In this thesis, establishment of the Online Heritage Information Systems were analyzed, parameters of the system, project phases, management strategies, digitization techniques and standards, legal concerns were studied. Also existing online projects which carried out by now were reviewed. After all these studies, in the case of such project application occurs in Turkey, strong and weak points, threats and opportunities were determined by SWOT analysis. By PEST analysis, main political, socio-cultural, economic and technological factors which can affect this project were stated. As a result, a model proposal and status analysis were completed to guide future projects regarding the establishment of the Online Heritage Information Systems in Turkey. Regarding the subject, this thesis states where we are and what we should do. ",
    "supervisor": "Prof.Dr. Gülen Çağdaş",
    "title": "Establishment of the online heritage information systems and status analysis for Turkey"
  },
  {
    "author": "Mehmet Baykara, 2011",
    "keywords": " parametric models, parametric techniques, computer aided design, parametric design, computer graphics",
    "summary": "Designer’s life evolves with the every step of life and one will continue to exist through this process even though it is up to him or her keep up with it or not. Designer shows tendency to possess unconditionally to getting the benefits of the incomes that technology presents. However, there is great difference between the two words of possessing and mastering, and if one is not getting the offers of technology efficiently, will crush under the burden. In design process, there are breaking points such as trial and error and going back to square one, and if a designer uses the computer like an automated pen and eraser, there will not be any good for the process. In architectural design even the simplest of the used systems, gives freedom to get out of the framework and make changes to the path of design. Moreover, using systems like parametric design, which requires researches and analysis over the design context, provides rules, constraints, and finally enables trial and error, generating, rapid-prototyping, is a way of using technology efficiently. This thesis investigates the role of the parametric design technology inside the architectural design progress. Parametric design and the use of this procedure investigated in four chapters. While first chapter clarifies the approach of the thesis to the content, in the second chapter the definition of parametric design described. The meaning of parametric design, development, components and the effects on the architectural design process are specified in this chapter. Different parametric design examples at different scales presented at the third chapter to prepare a ground for the last chapter. The process of coding a parametric design program is investigated in the fourth and the final chapter. ",
    "supervisor": "Prof.Dr. Gülen Çağdaş",
    "title": "Parametric design in architecture and a model proposal for settlement design"
  },
  {
    "author": "Elif Günay, 2009",
    "keywords": " navigation, KKBS, databasei resolution, İstanbul, architecture",
    "summary": "In this study by examining the Multi Resolution Spatial Databases and GPS supported navigation systems, it is aimed to study an alternative database model with a purpose of familiarizing the city to the architects. It is foreseen that the database model generated based on Istanbul city can work on mobile phones with GPS support. The software called IMIN is consisting of interactive interfaces which is formed according to the data retrieved by the user. The software which is specifically designed for the architects visiting Istanbul is to be made up of five major parts; Istanbul s history, Istanbul s architecture, a sightseeing plan for Istanbul, social and cultural activities in Istanbul and useful information about Istanbul. User can access to static data in the database and dinamic data which is updated multi layered. IMIN software is considered to be an alternative model for virtual reality and artificial intelligence studies and the model structure is intended to be flexible. ",
    "supervisor": "Assist.Prof.Dr. Yüksel Demir",
    "title": "A solution model for architectural navigation : IMIN"
  },
  {
    "author": "Gizem Öneş, 2011",
    "keywords": " systems, relationality, patterns, networks, complexity",
    "summary": "In the scope of the thesis, complex systems and geometric setups are being investigated both theoretically and practically, and a tool model that can be used in design process within integrated and associative design approach, is proposed. At the junction point of these two topics, to be able to sample the concepts and to provide a clear expression, a narration to scale and the topic has been applied. While accepting that the approach can be applied to a broader range of scales and topics, the use at multi componented and dynamic problems will be more efficient than others. Eventually, based on the living city idea with its dynamic components, the thesis focuses on the city with its inner relations as an example design problem. After conceptual research, as a test field of the mentioned approaches, a tool model which can be used in urban research is developed. Accepting the city as a living and complex body, the model can ben used both at the design and analysis processes. The tool is presented as program pieces currently, and can be developed in the future work, on the other hand, it is stated that the model is independent from digital media and software. It is actually, stated as a part of the thinking process of the designer.",
    "supervisor": "Prof.Dr. Gülen Çağdaş",
    "title": "Reflections of integrated and associative approach to design and a model proposal based on graphs"
  },
  {
    "author": "Yazgı Badem, 2007",
    "keywords": " genetic algorithm, evolution, architectural design, Form-G model",
    "summary": "The main goal of the research is to get information about the usage of genetic algorithms in architectural design and develop a design tool which can be used to generate conceptual building envelope form alternatives by using genetic algorithm. At the begining of the thesis, prior searchs on the usage of genetic algorithms in architectural design are introduced. In the last part of thesis, a new generative tool is introduced. This tool is a prototype plug-in for 3 dimensional visualising programs and called Form-G. This plug-in generates form alternatives with symbolic representations. Designer determines the boundaries of the construction site and chooses the number of objects that the system will use to produce new forms by using genetic algorithm. After the generation process designer get possible 3d form solutions that meet with the constraints of the design problem. The main purpose of the model is to create building envelopes according to chosen three dimensional objects. Each object is accepted as a building mass and the placement compositions of these objects are created according to fitness function criterias. The model produces many solutions and the design process goes on by the help of the user, deciding on the appropriate alternatives and making choises according to his needs and aesthetical view, makes the user policy maker of the system. ",
    "supervisor": "Prof.Dr. Gülen Çağdaş",
    "title": "The usage of genetic algorithms in creative archıtectural design"
  },
  {
    "author": "Bilgetay Kısacıkoğlu, 2004",
    "keywords": "",
    "summary": "The research of artificial intelligence began almost with the invention of computers. As the rapid developments in computer technology went on, the research of AI started to spread out in many fields but when it came to deal with complex and ill defined problems, it has been understood that reaching the human intelligence is yet far away. Design problems are one of those problems that proved this fact. Design approaches in computer environments are generally concerned with the support that will be given to the designers. In this thesis, a constraint based layout generator expert system will be presented. APSIS (architectural plan layout generator by exhaustive search of constraint conformity in the design space) that we have developed deals with space planning in architectural design. An interactive usage process that the problem specification is gradually under control of the designer is proposed for APSIS considering the complex aspects of space planning that will be explicitly described in this thesis. The system automates layout generation by using an exhaustive search algorithm that is capable of finding all grid solutions that satisfy all constraints specifying layout problems at one floor level. The search organization that dimensioning comes before considering topology, is different than all other systems in literature. This has become a test subject in our research to explore the disadvantages or advantages by experimenting and to discuss the validity of this method. This thesis also reports an ongoing research of a method to form a feedback report after a generation. ",
    "supervisor": "Prof.Dr. Gülen Çağdaş",
    "title": "A constraint based layout generator expert system"
  },
  {
    "author": "Halil Sevim, 2013",
    "keywords": " Arapgir, Malatya, space syntax, database",
    "summary": "Human is an interactive creature. Therefore, the environment that people live interacts human and vice versa. Thus, human integrates with the environment and pursues its interaction within adaptation. Human, because of its nature, direct its environment according to its needs. This helps people to see their cultural and social heritage. Information that create cultural and social identity, considering in a structural scale, is a source of information for architects. Buildings that includes the information is called architectural precedents. Human wants to protect the information that include itself and interactive environment, because they make the cultural and social infrastructure. If the information live for generations, the desire for protecting it will be achieved. There are several steps for achieving it. Firstly, data should be accumulated then it should be understood and preserved correctly. At this point, data gained from analysis from architectural precedents and the information?s importance are huge. The space syntax analysis, visibility analysis and structural analysis are made to understand the specifications of architectural precedents. According to those analysis, the structure can be understood and it might be classified for results. Thus, newly produced venue setups can be designed by its culture and venue usage habits. In this context, the architectural precedents domicile samples in Malatya Arapgir considered. Some analytic processes, spatial order, visibility and structural, are used to those conventional residences. According to those studies, data that gained from architectural precedents and analytic information that help to the future designs; are stored systematically and also they opened to access with some different filtration options. Within this scope in the first part, the purpose of the study has been written. Its scope and methodology are been explained. In the second part, data, informatics and knowledge topics are mentioned. Information and its way of storage are explained. Datum that is stored is an infancy period of informatics. The informatics, which gained from shaping the datum, is define the knowledge. To use this knowledge, uninterruptedly in digital media, they have to be stored and protected carefully. The storage systems are useful for accessing data and adding, deleting or changing them successfully. In the third part, databases and sample bases are explained. Databases are researched specifically (history of it, types of databases etc.) Advantages and the importance of databases are mentioned before. The relation between architecture and databases, and how to use databases in architecture is explained. Database is a group of data. Datum that has a specific purposes made this group of data. A database system is shared to an abundant of user. This system make data storage, organization and examination. Designers try to make their studies by taking samples from digital media. Those samples are systematically stored information. The system that united from these samples is a sample base. In the fourth part, researched database and the application of sample base is mentioned. Studies about database and sample base is helpful for future studies. Working principle and structures, methodology and technology of database and sample bases are mentioned before. Fifth part, space syntax analysis in the architecture is explained. Space syntax analysis are researched in two separate subjects: visibility and convex analysis. One of the purposes of architecture is organization of space. When organizing space it?s very important that protecting cultural activities that direct habitants live and order of the residents. This space organization reflects inhabitants? culture and also it reflects characteristics of them. Sixth part, space syntax analysis explained by applying architectural precedents in Malatya Arapgir. Convex resident and visibility analysis applied and moreover, some structural analysis been made. The calculations according to these analysis have been calculated. Biggest part of the researched houses are belonging to second part of the 19 century and first part of the 20th century. The basic components of the Arapgir houses are stone, cob and wood. Researched architectural precedent samples are Bekir Tan House, Kaşgal House, Keşiş House, Miraşoğlu House and Çağdaş House. In the visibility analysis floor plans researched separately. The research is a kind of analysis that express the angle that can be seen from the height of human eye point of seeing. Convex space syntax analysis comprise the whole house and the relations between all components defined, then evaluations made according to those components? magnitude and positions. Structural analysis that called `Entrance Analysis?, `Projection, Champ and Balcony Analysis?, `Structural System Analysis? and `Circulation Analysis? are made to understand the structural specifications of architectural precedents. A template format including ,structural photographs, floor plans, informations about structures, analysis maps and estimations for analysis, created for architectural precedents. Informations about rewieved architectural precedents converted to template information format. Thus make it possible to access informations as a whole. Despite visual varieties of buildings in Arapgir region, those buildings are similar according to their usage and functionality. Seventh part,database design is made and database is introduced for rewieved and analysed architectural precedents. Entering informations to this database is explained; charts are created for sample bases. System is made by using Microsoft Access. The system have several options like filtration, googling, printing etc. and it has an interactive frame. Name of the system is `?Historical Buildings Information System.?? In the conclusion part, outcomes from the research are interpretted, potential of the system is mentioned and futuristic applications areas are argued. To protect an area, it is required to understand and live the area. Functions of components of the area can be understood by this way. Why components located to there? and why they are functioning in that way? very important questions for understanding the connections. In accordance with this purpose,important analysed informations are saved thanks to studies. Moreover, flexibility of the database make it possible to use it in different regions. In future this system will be applied to various regions and this will give systematic informations and cultural treasure for future generations. When rewieving potential of the system, comparison between different regions? buildings become possible because of various regions? studies. Thus, it will enable us to compare, discuss, evaluate and understand cultural and social live tracks. ",
    "supervisor": "Prof.Dr. Gülen Çağdaş",
    "title": "Suggestion of a design model based on analyses of architectural precedents: traditional houses of Arapgir "
  },
  {
    "author": "Özer Arusoğlu, 2010",
    "keywords": " airports, passenger movements, simulation",
    "summary": "Airports have a very important role in todays transportation sector, because of the increase of airplanes and flights each day, terminal capacities become unsatisfactory and delays occur. Despite the plans done on design stage, new facilites to meet the need are unsuccessful in practice. For solving this problem, creating a model to test the capacity and efficiency requirements of airports is intended. Design principles and criterias that can be used in airport planning are given. In this context, principles and criterias of choosing right location, runway, apron and terminal relations are examined. Afterwards, relations between facilities in terminal buildings are analyzed and incoming/departing passenger flow diagrams are established. With this diagrams, certain facilities are analyzed and average utilization times, capacities and specifications of each facility are observed. After this, passenger characteristics are studied and passenger types, walking speeds, actions on normal and panic situations are examined. Moveover, for developing the simulation models of airport passengers behaviors, definition of the model, content, methodology, area of usage and user group are specified. After, specifications and restrictions of the model are explained and, according to these criterias, flow diagrams and algorithms of the model are stated. Finally to evaluate the results, analysis measures are given. ",
    "supervisor": "Prof. Dr. Gülen Çağdaş",
    "title": "A model proposal for simulation of airport terminal passenger movements"
  },
  {
    "author": "Tuğçe Darcan, 2014",
    "keywords": "architectural aesthetics, intermodal resonance, consciousness, elusiveness, empathy",
    "summary": "The thesis aims to propose a comprehensive approach to architectural aesthetics. Apart from the key terms adopted from the field of neuroaesthetics, knowledge from other fields such as neuropsychology, behavioural psychology, evolutionary aesthetics, architectural design theories and philosophy are benefited in order to grasp an interdisciplinary perspective to the controversial issue of architectonic contemplation. Initially, based on the cumulative knowledge, the argument of intermodal resonance is introduced, referring to the aesthetic value of cross-modal stimulation among multiple sense modalities. Structured by three basic concepts; micro-consciousness, empathy and ambiguity, intermodal resonance is regarded as the core of architectonic contemplation. Subsequently, qualitative aspects that elicit intermodal resonance are discussed along with a broad collection of sample projects. First, specific samples of functional and spatial solutions are exemplified as subtle initiators of intermodal resonance. Secondly, articulation of spatial elements is handled in parallel to the resulting cross-modal sensations. Thirdly, environmental elements are considered as nature-based design elements of architectonic space and modifiers of cross-modal stimulation. Finally, environmental adaptation is elucidated as another factor that paves the way for intermodal resonance. Overall, architectural aesthetics is tackled as a matter of sensual impressions rather than the sum of qualitative attractions. A resonant and fragile, that is to say, a sensible and adaptive architectonic approach is favoured as the key to an aesthetic spatial atmosphere, which is capable of triggering intermodal sensations. ",
    "supervisor": "Prof. Dr. Gülen Çağdaş",
    "title": "An intermodal resonance approach to architectural aesthetics "
  },
  {
    "author": "Eda Yunusoğlu, 2010",
    "keywords": " performance based space design, sound data bades space design, sound reflection, reverberation time",
    "summary": "The objective of the thesis is to develop a model, which is based on acoustical performance of a space as input data to generate form in an early design phase. The model primarily consider reflection phenomenon of sound in enclosed spaces. Through the implementation of the model, acoustical data is transformed into data of form. Model is based on reverberation time formula. Thus, the model enables the generation of series of formal information. ",
    "supervisor": "Prof. Dr. Arzu Erdem",
    "title": "A model to generate form by reflection phenomenon of sound in enclosed spaces"
  },
  {
    "author": "Emirhan Coşkun, 2011",
    "keywords": " user movements, agent systems, emergence, emergent city movements, city dynamics, artificial intelligance",
    "summary": "Today, with rapidly evolving information technology, computer technologies has become an interface rather than a tool for design process. With the development in computer applications it has become possible to solve design problems which were not possible to handle before. Computer environment which has become an interface rather than a tool for design has also led to the emergence of a number of concepts. New concepts such as Computer Aided Design (CAD), Computer Aided Manufacturing (CAM), Computer Aided Engineering (CAE) are being involved in design process. With the development of Artificial Intelligence (AI) , AI has earned an interdisciplinary position. Approach to the problem solving process in the process of architectural/design problems is to be addressed as an important point within the scope of evaluation process. In this context user movements have a very critical role in process of problem solving according to the design problems. While designing or solving a design problem , ignoring the user movements can lead to unwanted results. Within the scope of this thesis user movements in city are considered in the context of emerging urban part/particles as a preliminary study. Agent based systems have an important role not only in the scope of space syntax, different representation methods but also in the scope of producing different results. By taking advantage of this features of agent based systems, a processing model has been developed according to the user movements in the city. ",
    "supervisor": "Prof.Dr. Gülen Çağdaş",
    "title": "An integrated model for emergent city behavior based on user movements"
  },
  {
    "author": "Ezgi Ak, 2006",
    "keywords": " physical space, space-time, virtual space, interaction, computer technology, virtual reality, cyberspace, movement, time, information",
    "summary": "In this study, space concept transformed with the computer technologies is examined by focusing on physical space, virtual space as a product of mind and cyberspace as a product of computer technology. Physical space, space-time concepts and the perception of physical space are emphasized. Virtual space that is a product of mind and its relationship with interaction and immersion are explained. Virtual space experience promoter environments are determined. Virtual reality and cyberspace concepts’ emergence with the computer technology is explored. The analysis of the basic space concepts namely physical, virtual and cyberspace relations is made. New space definitions set by the transformation of factors, which are effective on space perception and experience, are identified. Some designed spaces are examined which contains these definitions. The conclusion of the literature scan and the study of design cases, contemporary situation is discussed and the foresight about future is made. ",
    "supervisor": "Assist.Prof.Dr. Meltem Aksoy",
    "title": "Transformation of space concept with computer technology –new space definitions"
  },
  {
    "author": "Çağrı Hakan Zaman, 2011",
    "keywords": " spacial computation, tactile feedback, hand motion repertory",
    "summary": "Using sketch models in the early phases of architectural design process enables designers to think about the body-object relations and three dimensional evaluation, enrichening the design environment by providing a spatial perception including visual, haptic and kinesthetic interactions. Spreading through the acceleration and unification of the production processes, the digitization of the conceptual phases of architectural design brings about the question of how the benefits of working with hands can be transferred to the digital realm. Today’s technology points out that hand motions can be transfered into and processed in the digital platform and can provide a base for extending the digital design process with this aspect. Many researches show that the three dimensional perception supports the visual perception and strengthens the creativity. Depending on this fact, we assume that the physical model making supports design processes. In our research, we aim to sustain this support in different design environments and study the transfer of the hand motions used in the physical model making processes and use in the digital design environments. We show the results from the observations taken from the conceptual model making processes and analyze the actions involved in these processes as the first step of the research. Depending on this observations we classify the actions according to the main characteristics of the hand motions and propose a recognition schema to be processed in the digital platform. Following the analysis and the classification of the hand motions used in the model making process we aim on translating these hand motions into the digital platform. We discuss the technologies and methods used for hand motion capturing and recognition, and develop a design environment utilizing the hand motions used in the model making processes. We finalize our approache by presenting a set of algorithms for the object deformations conducted with the hand motions. Finally, we test the design environment and discuss the results. ",
    "supervisor": "Prof.Dr. Gülen Çağdaş",
    "title": "A hand motion based tool for conceptual model making in architecture"
  },
  {
    "author": "Ali Ulvi Altan, 2002",
    "keywords": " architecture, bosphorus residences, visual database, database",
    "summary": "In this study, a visual database model has been presented. The model; under the considerations of systematic and representational needs of visual information in design, is proposed to give the designer relevant visual references and visual information during all phases of design. Using the visual architectural images that are analyzed with respect to their functional and physical limits, the questions; how should the database be structured in order to achieve the most efficient and information giving interface, and which tools should this interface involve to assist the designer, is discussed. This database model is prepared for the visual information retrieval from the historical residential buildings in the Istanbul Boğaziçi shores. Considering the adopted physical relations, numerous buildings were analyzed with different landscape relations. Each building is transferred to the database with its special visual information under the predefined systematic order. The buildings were represented in the electronic media with these predefined visual information. When we consider the works in this era, the proposed database gives the designer the relevant architectural visual information about the buildings at Boğaziçi Shores. The thesis is comprises five chapters; In the first chapter, the aim, concept and methods of the work are defined. In the second chapter, the function of databases in architecture is defined and some general information regarding the structure of databases are discussed. In this respect, the designer's need for visual references is discussed and by examining the precedents and the potentials of databases to correspond to this need in architecture is determined. Ways of assisting design with systematically structured visual architectural information has been discussed by comparing present works in this field. The third chapter, is more concerned with the computational use of databases in assisting architectural design problems. After giving general information on the mentioned subject, the solutions proposed to represent the visual architectural information in electronic media, and ways to analyze, structure or represent, this information is widely discussed giving examples from the recent works. Following this introduction, graphical knowledge interfaces that assist the designer with the mentioned tools are explained through examples. The proposed model \"Historical Boğaziçi Buildings\" is defined in the fourth chapter. The models conceptual limits are discussed with respect to the model's structural input, algorithmic and output properties. Afterwards the model is evaluated and \"Historical Boğaziçi Buildings\" database program is introduced. The fifth chapter, consists of the results and the probable forthcoming expectations of the model.\u000b ",
    "supervisor": "Doç.Dr. Arzu Erdem",
    "title": "Visual database application: Historical residential Boğaziçi buildings "
  },
  {
    "author": "Evren Müge Şeker, 2006",
    "keywords": " artificial intelligence, multiple agen based systems, agent based user movement model, modelling movement in museums with agents",
    "summary": "Artificial Intelligence is a dicipline that conducts studies on computer models which can think, perceive, move and use knowledge to solve problems like humans. Distributed Artificial Intelligence, meaning multi agent systems, is an agent society which can use distributed information sources and works collaboratively to reach a solution, for the purpose of solving more complex problems. Every agent in this society is a software that is autonomous, perceives environment and reacts to its surroundings, and exploits different techniques of artificial intelligence. It is inevitable for the multi agent systems, which is a field of artificial intelligence and used for transferring human movements to the virtual environment, to be in the architectural design area in which human factor plays an important role. In architectural design, pedestrian movement has a role of both directing and restricting designs. Predicting pedestrian movements in advance, provides an important advantage to the designer. The aim of the thesis is devoloping a visual simulation model for evaluating the circulation systems of both new buildings at design stage and existing buildings, and enabiling the designer to reach the best solution by analyzing the circulation systems of different alternatives during the decision making process by using developed model. With this purpose, this thesis proposes an agent based pedestrian movement model. The proposed model is applied on a selected museum and the pedestrian movements are observed.",
    "supervisor": "Prof.Dr. Gülen Çağdaş",
    "title": "Modelling agent based pedesterian movement: case study museum"
  },
  {
    "author": "Burak Yardımcı, 2012",
    "keywords": " architecture, architectural design computing, parametric design, user features, housing design",
    "summary": "A wide-range housing problem was arisen especially after First World War all around the world. To solve that problem, new housing reproduction era started in an all cities that had lost the housing substance after the war. The standardization method had used to solve the need of that housing substance. The standardization approach that had developed with the Ford in motor industry called as T-model production had applied to the architecture field to solve the housing demand in a short time. Although this approach of standardization was successful to solve the problem of huge housing demand, it has caused negative effects on habitants. The new problematic community who has different needs and expectations even so living in same type of flats had appeared. The housing problem was caused by standardization forced the designers to search for a new method of housing design especially after 1960’s. The new alternative methods that were used in housing design are read in that research by examples. The examples are criticized with their advantages and disadvantages while creating a new model of modular housing design. In the second chapter of the thesis, the different methods that are used in housing design after 1960’s are exampled. The methods are researched by their examples that are divided in three parts as conventional methods, methods in utopian projects, and computer aided housing designs. All examples are criticized with their effects, advantages or disadvantages. The possible parts of the projects that will use in the model are explained with their reasons and the general explanation is made by all examples. The Scheepstimmermanstraat projects that were first planned by Jon Habraken then, designed by West 8 group, Malaqueira houses by Alvora Siza, Charles Correa’s Hudco project and Habitat 67 housing project by Moshe Safdie are researched as examples for conventional methods in housing design. Common positive characteristic of conventional examples are modular way of approach. In all projects, modular derivation method is used to reach geometries that are more complex with simple structures. Another positive characteristic that existed only in Malaqueira project is the design process that related to user need and time flow. The common negative characteristics of conventional examples are the limited creativity in projects that have only variability in planning scheme and facade design. Another method that is used for housing design can be seen in utopian projects during 70’s. Especially, the projects from Kisho Kurokawa, Arata Isozaki and Kenzo Tange are detailed criticized in that chapter. The main common point in all utopian projects is to see the building as an organical life form that grows by prescribed scheme. The designers tried to create living habitats in all projects. They planned a core that contains all service systems, infrastructures and vertical circulation system inside and placed the living units at the edges of that core. The complexity of all service systems and structure is solved by that core system easily. However, the negative characteristic of utopian projects is the limited creativity in living units. All the living units are just repitition of themselves and there is not any variability in living modules. The last method is used for housing design, that is searched in thesis is computer aided design method. Computer aided design method was firstly started as non-parametrical projects during 90’s. The Vertical Project that was designed by MVRDV group is read as first example in thesis. T-trees Social Housing project is second example to understand the modularity in evolution. Other examples, which are discussed for computer aided design method, are Barcode project and MHAS Modular Housing Arrangement System. Nearly all examples are based on the modularity approach as the conventional housing projects. However, with the development of CAD systems the number of the parametric projects is increased. The aim of reaching variability by the evolution of modules is common specialty in projects that are developed with computer aided design method. Designers tried to reach geometries that are more complex by starting from one module and they defined several living units. Generally, in all examples, the relation between living areas and core system has important role. Designers tried to place the core system first by defined rules and then try to reach geometries environs of a core. Another characteristic of computer-aided systems is their interface. Some models are based on real-time change interface although some of them are not. The real-time change interface specialties criticized pozitivly and try to adapt in new model that will create. The algorithms of all examples are examined carefully and try to find the similar way of algorithm using in new model. In the third chapter, the new model is defined with its details in all phases. The reason of choosing the program is explained and the program that used to create the model was being introduced with its characteristics, interface and work scheme. The characteristic of the program is classified and the reasons during the selection of the program are told. Other programs and work schemas was presented with the reasons for choosing them. All the parameters, circumstances and all other specialties of the model are explained with their causes and results. The workflow of the model is shown with images and all problems that are existed during the process are defined. All the parts of the model such as sliders, parameters, export and library specifications and interface are explained and the real time changes are shown with images. The role of the parameters is explained with their ranges and numeric specialties. The algorithms of the model are written in that part with explaining the codes and parameters for relevant researchers. The optimal values and their reasons are explained in that part for parameters. The parts of the script are explained with visualizations that are prepared by other programs. The export and import relations of the program with other CAD programs are introduced. The project that was created by the model was converted to the other data files to complete presentation. After that, the project was visualized and the project was completed. In the last part of thesis, the new model is criticized with its negative and positive characteristics. The deficient points of the model were explained with their reasons and the goals for future researches are defined. The possible evaluation of the model in near future is explained clearly and the boundary of the parametric model is drawn. The possible areas of expertise and usage of the model is being told. The studies that can be develop after the thesis project and its prospective future is discussed. Future targets of the model was explained with their target aims was explained. The missing parts of the model such as database creation, data mining process, variability in core parameters and the visualization process is written with their roles in near future works. The way of attachment of these properties to the future model is explained clearly. The thesis project concluded with the explanation of the importance role of the similar models in housing design process and their potential effects during the housing design process. The importance of the variability of the last product that is created by model algorithm is discussed with architectural prospective. ",
    "supervisor": "Lec. Dr. Hakan Tong",
    "title": "A parametric model proposal for modular housing design"
  },
  {
    "author": "Sibel Yasemin Özgan, 2012",
    "keywords": " augmented reality, augmented space,  urban space, virtual space, virtual city, virtual culture, digital culture, archeologic heritege, archeologic ,digital heritage",
    "summary": "Contemporary advances and innovation in technology have altered human everyday practices. One of the most significant of these has been augmented reality (AR), which is the brief definition of reality blended by virtual information. The tempting developments in AR technology have added another layer of rapidly changing information to the actual space. As the virtual information is continuously increasing, it has become the new dimension of the physical space rather than just a separate layer. Thus, the design process of the collective virtual knowledge has revealed as a new architectural task. As the space is re-defined through new virtual layers and becomes multi-dimensional, new architectural approaches have come into view. The space should be immersive and present an innovative approach to the augmented space. Hence, designers are required to participate not only in the physical design process, but also in the design of information flow. This study intends to examine how cultural heritage sites could be redefined with technical possibilities and moreover with augmented reality applications and systems. Investigations on the level of Yenikapı Urban Area are derived by the help of newest technologies, effective on the re-generation of augmented spaces. In this sense, the purpose of AR usage in Yenikapı is to build up a medium for cultural heritage exploration and to provide interaction via the 5 senses with this information space. To this end, this thesis presents a mobile game application interface, which works as a medium for Yenikapı visitors seeking for more knowledge about the area. ",
    "supervisor": "Assist. Prof.Dr. Yüksel Demir",
    "title": "Use of augmented reality technologies in cultural heritage sites; virtu(re)al Yenikapı"
  },
  {
    "author": "Yasemin Yılmaz, 2008",
    "keywords": " architecture and music, shape in music, notation, harmony, interdisciplinary design, creative design, sound-space, sound-sculpture, electroacoustics, sound instellations, sound synthesis",
    "summary": "The proposed approach in this thesis is an experimental work that utilizes data representation and data manipulation by way of using the computerized design techniques through the interaction between music and architecture. The creative design methods that enable the transformation of musical data into visual form are discussed. The examples of design approaches, methods and concepts through history, that enable multi-sensual perception to develop from the interaction between the senses of seeing and hearing are comprehensively analyzed. The design approach proposes an alternative creative design method, developed in the light of these concepts. The approach is a computer aided form finding process, which will bring new conceptual expansions to basic creative design.",
    "supervisor": "Assoc.Prof.Dr. Arzu Erdem",
    "title": "An approach to generate form in the intersection of music and architecture"
  },
  {
    "author": "Lale Başarır, 2009",
    "keywords": " architecture, computational fabrication, nanotechnology, robotics and artificial intelligence",
    "summary": "Rapid pace of recent technological developments play a very constructive role on the way humans relate to their environments. The objective of this thesis is to make a forecast of what architecture may evolve into within the context of transdisciplinary technological developments. The possibilities are analyzed within the intersection of four major disciplines: Nanotechnology, Robotics, Artificial Intelligence (AI) and Genetics. These disciplines are analyzed in terms of technological innovations they generate and paradigmal promises they hold for architecture. Nevertheless, the main focus is on nanotechnology, and the possible paradigm shifts it might cause in architecture in a few decades. Furthermore, Genetics is the area in which Nature’s own technology of data storage for cellular fabrication is analyzed, and Robotics, bonded very tightly with AI, feed the subject fundamentally in terms of how a new model for an autonomous architectural production is envisioned. A constant conversion between hardware (matter) and software (idea) is analyzed. Artificial Intelligence adds greater automation possibilities to expertise of robots. Greater automation requires greater control and perfection in manufacturing. Nanotechnology, currently, leads the closest way to this type of perfection. Manipulating matter at atomic and sub-atomic scales as means of automation and molecular manufacturing possibilities are analyzed. Deriving from current developments and growing hardware and software capabilities, a forecast is made on how future buildings will be. The thesis offers a fictive approach for architecture along with other suggestions from some pioneers of physics and architecture. These issues bind the thesis thereby introducing immortality as a notion for future buildings as architectural products. ",
    "supervisor": "Prof.Dr. Gülen Çağdaş",
    "title": "Possible futures for architectural entity within the context of transdisciplinary technological developments"
  },
  {
    "author": "Mehmet Mert Ayanoğlu, 2006",
    "keywords": " game theory in architecture, virtual spaces, 3D computer games, computer game technology",
    "summary": "The thesis named “The Utilization of Computer Game Engines in Architecture Education” aims to explore the new interactive learning environment in the virtual world differently from the traditional methods of architecture education and test its availability. In accordance with this, in the second and third chapters, games and play in architecture, design-game analogies, virtual environments, distant learning, computer game technologies, 3D computer game engines and virtual heritage subjects are analyzed. In the fourth chapter virtual environments created with the 3D game engines are examined via their purposes, software infrastructures, and results of their evaluations. In the last chapter, a model of virtual environment established with a 3D game engine aiming to be useful in the context of virtual heritage is being suggested. Within the concept of this model the end product is developed by compiling the drawings, models and audio data gathered from various software, inside the game engine’s editor application. The model aims to make evaluations on the utilization of computer game engines in architecture education. The uniqueness of the suggested 3D model in its era and the enriched content of the thesis points out it to be useful both theoretically and practically. ",
    "supervisor": "Assoc.Prof.Dr. Sinan Mert Şener",
    "title": "The utilization of computer game engines in architecture education"
  },
  {
    "author": "Erhan Karakoç, 2015",
    "keywords": "",
    "summary": "Adaptive architecture provides the user to live under the comfortable and ideal conditions in the building by forming the architecture with environmental factors. Addition to this, adaptive architecture is important regarding the protecting the environment and sustainability. In the world which the conditions change constantly, the environmental factors play an important role. It is necessary to design adaptive buildings in which the climate changes occur permanently. Performance Based Adaptive Buildings have become much more important in case of the changeable climate parameters. Performance Based Adaptive Building Shells, which can change according to the environmental factors, enhance the living comfort of the users, ensure the sustainability, reduce the operation costs and extend the life of the building thanks to integration the other disiplines with the architecture. The architectural design has different methods. Performance based adaptive architecture is one of these methods. Because the architecture issues are related to lots of variables, it has become necessary to examine these issues with the other disiplines like engineering, natural and social sciences. In this thesis, it has been evaluated severally in regarding to performance based adaptive architecture and these evaluations are shown via the example analyses. The inputs of the Performance Based Design are examined and the effects of these inputs upon the Adaptive Building Shell are explained by evaluating the datas. ",
    "supervisor": "Prof.Dr. Gülen Çağdaş",
    "title": "Performance Based Adaptive Building Envelope Design"
  },
  {
    "author": "Özgün Balaban, 2012",
    "keywords": " Otomatic Regulation Eligibility Control, Building Information Modellin (BIM), Building Regulations",
    "summary": "In this thesis, an automated code compliance checking system is developed to be used in the checking of the construction projects that are done by architectural, engineering and construction firms against the codes, which is a must for getting construction permits. For this reason, past studies are reviewed and the results that are published with these studies are used in this study. The developed system checks the parameters of the building elements of a project that is modeled in a Building Information Modeling (BIM) and controls if the values of the parameters are in range that is specified in codes. After this check the user is informed about the check and if there is a building element that is not in accordance with the codes the system warns the user. The scope is limited for some clauses from the Turkish Fire Codes. In the future the remaining clauses will be completed. ",
    "supervisor": "Prof.Dr. Gülen Çağdaş",
    "title": "Automated code compliance checking: A system for checking fire codes"
  },
  {
    "author": "Esra Gürbüz, 2009 ",
    "keywords": " emergent systems, architectural design",
    "summary": "The role of computation in architectural design has been discussing for the last two decades. Using computation as a media in design field, rather than a tool opens up new design and manufacturing approaches. The development of new fields like; CAD (Computer Aided Design), CAM (Computer Aided Manufacturing), CAE (Computer Aided Engineering) offers possibility to rethink the design process. Emergent systems, as one of new design approaches which are handled in the content of this thesis, are used frequently nowadays in architectural design. With emergenct systems we can find solutions for the problem of organizing different agents and layers as a whole, synergy of form, material and behaviour, during design process. In the content of this thesis, emergent systems’ integrated approach are explored via examples from architectural design education and practice. Afterwards through these examples some suggestions about design future are proposed. ",
    "supervisor": "Prof.Dr. Gülen Çağdaş",
    "title": "Emergent systems in architectural design"
  },
  {
    "author": "Ayşe Esra İdemen, 2003",
    "keywords": "",
    "summary": "Serious earthquakes throughout centuries have affected Turkey as a country located on one of the most important seismic zones. These earthquakes have caused thousands of people become injured or disabled, even their death and also have left thousands of them homeless. Although there were many of them have been experienced in the past, the earthquakes recently experienced in 1999 on the 17th of August in Kocaeli and 12th of November in Düzce have revealed as the results often thousands of people who have died and besides the economical, sociological and psychological difficulties, demolitions have occurred afterwards, that Turkey still can not take lessons from the earthquake. In the last 20 years, as a result of the rapid changes in the building and construction field, new technologies and new construction techniques have been started to use, and in addition to this the building typologies have changed. But during this change period, there have been augmentations in the number of illegal settlements, even having architectural irregularities which have been prohibited by the regulations, it has been pretended not to see these buildings being constructed and owning a license. By the pioneering of economical reasons, the regulations related to the building design and constructions have been disobeyed, as a result of this it has not been taken pains the earthquake resistant building design issue, so that as a natural phenomenon, the earthquakes have turned into disasters. Earthquake resistant building design issue generally includes the relations among the building itself, the ground it is settled and its environment. Beginning from the early stages of architectural design process, it is needed to deal with the factors such as the height of the building, the ground situation it will be constructed on, its structural organization and the relation with the buildings in the neighborhood as a whole. And as the person deciding the geometry and the interior design of a building, the architect has been given serious responsibilities on this issue. In this context the first source that an architect should consult must be the laws and the regulations concerned with the earthquake. In the scope of this thesis, in order to light the way to the design of safe buildings with high quality, the concepts of earthquakes and its effects on buildings have been examined; by accepting the \"Turkish Specification for Structures to be built in Disaster Areas\" as the fundamental, it has been given place to the descriptions, explanations and examples which can guide the architect in structural design. Xlll\u000bFurthermore by emphasizing the importance of torsion effect on buildings, an expert system that has been improved for using in the beginning of architectural design, which controls the center of rigidity and center of gravity relation in buildings, has been introduced. This study is formed of 6 sections. In the first section, general information has been given, besides the purpose and the content, the study methodology and the importance of the subject have been explained. In the second section the earthquake, the earthquake types, formations, and the effects of earthquake on buildings have been explained. In addition to this, the torsion effect, center of gravity and center of rigidity concepts, the factors affecting the earthquake resistant buildings, calculations and formulas about this issue have been discussed. In the third section the architectural design and structural design processes have been explained, and in the context of \"Turkish Specification for Structures to be built in Disaster Areas\" the common design irregularities have been examined. Also the structural design principles have been given in this section. In the fourth section, general in formations on expert systems have been given, the interface of the AutoCAD program and its programming language AutoLISP have been introduced. In addition, the benefits of using an expert system in early stages of design process have been discussed. In the fifth section, the examples about the expert systems have taken part, and the using instructions of the program in AutoCAD interface have been explained. The examples are separated into two groups as simple and complex plans schemes, both two groups' examples are examined on figures. In the conclusion part, the benefits of the program have been discussed and is has been stressed that the lack of communication between architects and civil engineers should be decreased. In the appendix part, the source code of the program and the logical structure of the expert system are found. ",
    "supervisor": "Prof.Dr.Sinan Mert Şener",
    "title": "An expert system setting up the centre of rigidity relation in the architectural design stage"
  },
  {
    "author": "Tuba Kuzgun, 2004",
    "keywords": "",
    "summary": "Computer aided architectural desing is just a young research area where the main goal is to intensity architectural design by using computer technology effectively in the design process and the general objective is to improve architectural design from the creative problem-solving viewpoint. Any research to this area needs quite an interdisciplinary review and a complementary approach. The objective of this study is also to search the potantial capacity of computers to aid architectural design while analizing the design approaches of some of the sample models in the computer aided architectural design area. The attempt to integrate the computer technology into the architectural design process can be seen as realized nowadays by means of the CAD Systems which are being used effectively by the architects. But the main goal of the computer aided architectural design research is to make the computers be a part of the designing process in supporting the human about the deficient features of her by using the capacity of representation and memory. In the content of this main objective, knowledge based design systems have had an important role in the development process of the computer aided design systems because of the advantage of knowledge representation and the exploration capacity of possible design solutions space. But architectural design is more than otomation of the design which is the result of the approaches of the early knowledge based design systems. The exploratory and creative nature of the architectural design needs to be supported by some reasoning and kontrol mechanisms in the computerization process. Case-based reasoning and object-oriented approaches which are developed in this sense had been a resource for the study in the computer aided design area. The possibility of sustantion of computers with some learning and desicion making capacities is important in order to achieve the creative computer aided design. In this sense the genetic evolutionary design systems are one of the most promising approach in the computer aided design view. This systems aim to achieve surprise design solutions through the evolutioning designs by adapting biological evolution rules with the similar representation techniques to the computerized design process. This new approach is rather a precious phase in the computer aided design researh area. The instances of computer aided design models are not to be evaluated by means of a creativity criteria equivalent to the creativity of human design process. For, the creative products of human can also not be evaluated by any criteria because of the notional nature of the creativity. The creativity notion of computer aided architectural design have to be appreciated by means of the success in producing surprises and innovation in the design process. ",
    "supervisor": "Prof.Dr. Gülen Çağdaş",
    "title": "Computer aided architectural design and creativity"
  },
  {
    "author": "Ceren Bozkurt, 2010",
    "keywords": " urban design, kinetic system, biomimesis, robot technologies",
    "summary": "Since the industrial revolution technology emerges in the architectural platform like it did every single part of our lives. Nowadays a lot of people who want to be attached to natural life also want to be related with the technological devices. In this context, a system which is a technological device and is also responsive to its natural environment, decided to be produced. At the research state biomimetic systems, kinetic architecture and robotic systems are analyzed, application and design examples related to the subject are examined. UrbanCot, the kit that is going to be designed in this thesis, is aimed to be applied in urban areas. It will be shaped depending on the physical layout of the place it will stand and it will be inspired from a flowers mechanism which is moving its body related to sun movement. In that sense a Grasshopper plug-in is written to design and produce this system. UrbanCot creates a carrier system/skeleton covered with panelling systems which are tracking the sun all day long. These panels are covered with solar-cells connected with cable networking systems so they will produce electrical energy. By this way it becomes a responsive design to the increasing energy consumption and an urban landmark that will protect people from the bad weather conditions will make them gather under it. It is inspired from a flower’s mechanism in natural world. Moreover it is covered with panelling systems which are tracking the sun all day long. These panels will be covered with solar-cells, so they will produce electrical energy. By this way it will become a responsive design. ",
    "supervisor": "Prof.Dr. Sinan Mert Şener",
    "title": "A biomimetic urban canopy design equipped with kinetic systems"
  },
  {
    "author": "Ethem Gürer, 2007",
    "keywords": " innovative design, self-organization, emergence, evolutionary design",
    "summary": "In this study using the nature inspired Innovative Design Methodologies a new multilevel shape generation system is obtained. The model, which is generated within a simulation process in a determined location (Kuruçesme Island, stanbul), presents different design shapes. Innovative Design Methodologies, such as Evolutionary Design, Agent-Based Systems, Self-Organization and Emergence, were used during the model generation. Advantages and disadvantages of these innovative methodologies were analyzed and then, these systems were placed on different phases of the new model. This approach can be handled as a different one through its system organization and final design shapes. ",
    "supervisor": "Prof.Dr. Gülen Çağdaş",
    "title": "A multi-level approach to the nature inspired innovative design methodologies"
  },
  {
    "author": "Saadet Zeynep Bacınoğlu, 2012",
    "keywords": "",
    "summary": "Through the recent developments of the information technology in the 21st century, an ongoing transformation have occur in many areas of society as well as in architecture. Contemporary architecture is experiencing a shift from the design of a final object to the design of an organization concerning the dynamic and constantly transforming environment. The terms which are the general characteristics of contemporary design; multiplicity, variation, uncertainity, flexibility, interdisciplinarity and transdisciplinarity; are examined through a model developed within the thesis under the definition of mass customization. This model is developed as a design composition that involves different fields constituted by a network of relationships. In the era of mass customization , while the inputs and outputs become less clear and variable, the methods must become increasingly precise and accurate for a more unique design. Method as a description of the formation of a creative network of interrelations, requires the definition of an algortihmic process. Computational algorithmic processes are not only a transformation from object to fabrication. On the contrary, they are also a research of a creative formation as an exploration process of relationships between function, materialization, form, environment, body and performance. ",
    "supervisor": "Prof.Dr. Arzu Erdem",
    "title": "A model Proposal for architecture of possibilities"
  },
  {
    "author": "Betül Tuncer, 2009",
    "keywords": " urban design, computer aided design,  indormation systems, shape grammers",
    "summary": "In this study, a plug-in is developed for an early phase site planning process. An urban block is chosen as a reference point and the plug-in is designed to generate design alternatives referring to its built environment. In the first chapter, the subject of the thesis, objectives, scope and method of study are explained. In the second chapter historic background of artificial intelligence, birth of knowledge based systems from artificial intelligence studies are revealed. Shape grammars are explained enable the reader understand the field work consists of shape grammars. Following the historic background information of approaches used in the study, design necessities are explained. In the thrid chapter, implications of knowledge based systems are presented to acknowledge the reader about computational power of such systems, basing the system on knowledge is beneficial in terms of effectivness and speed in generation. In the fourth chapter, related field work is explained through its computer implications. The projects explained in this chapter will include CityEngine, The Melinkov Grammar, CityZoom, Urban Design with Patterns and Shape Grammars and Smart Solutions for Spatial Planning (SSSP). In the fifth chapter, the proposed plug-in is explained. It consists of requirements for using the projected plug-in, the features of the projected plug-in. Two applied approaches of the projected plug-in will be explained as well. The sixth chapter will conclude the thesis with general comments regarding the process shaping the plug-in, its potentials and restrictions and a comparison of two applications. ",
    "supervisor": "Assoc.Prof.Dr. Sinan Mert Şener",
    "title": "Mirrorer as a plug-in for urban design"
  },
  {
    "author": "Baran Yardımcı, 2007",
    "keywords": " diagram, diagram architectur",
    "summary": "In the scope of the thesis, firstly, the utilization of the diagrams through its definitions are examined and the evolution of diagrams, including the recent developments, has been described. On the third part of the thesis, the development of information technologies is evaluated through design epistemology and design tools and the recent studies on generative system models are investigated. Consecutively, various techniques to approach diagrams in these studies are compared and their common and differing aspects are discussed. Foresights on the present utilization and future potentials of diagrams have been put forward on the last part of the study, based on the research and the analysis. ",
    "supervisor": "Assoc.Prof.Dr. Arzu Erdem",
    "title": "Diagram as an architectural design tool"
  },
  {
    "author": "Yekta İpek, 2014",
    "keywords": " computer aided design, structural optimization ,performance based design, integrated design , structure design, design engineering",
    "summary": "By the means of the potentials offered by developments in technology field, the continuums in that we live have exposed to big shifts like the big changes that we experience in our lives. The tools offered by technological improvements have changed the design process; therefore, they have changed the design perception. The big shift, mentioned above, has been revealed in the last 50 years and it becomes one of the hot topics in the literature because of the rapid increment of the acceleration of developments in technology field. While these improvements have caused computational approaches to penetrate into design process, the topic of using computational approaches in the design process has become another hot topic in design literature. On the other hand, in the period that started with modernism, it had been experienced that the links between different disciplinary knowledge had been cut off. Therefore, in the last fifteen-year-period, the studies to reconnect and redefine the links have been gaining the importance and it has been postulated new frameworks for defining the links for new collaboration environments. These studies induce new disciplinary relationships that emerges new fields to study as new disciplines. In the architectural field, new collaborative working environments had started to be seen with the start of the usage of steel in building design. Coining the term “tension” was a milestone for architects and structural engineers to create new collaborative environments together. In this context, by considering the importance of structural design layer within architectural design schema, this thesis has been done with the motivations: • To alter the potentials of the differentiation of the working environments between architects and engineers in the period of modernism and pre-modernism • To reveal the potential to create more creative and more innovative design outputs by the help of combination of different disciplinary knowledge, architectural and engineering. Within the scope of the thesis, it is examined how the links between the disciplines, architecture and engineering, go through within the time passing from pre-modernism to today. Moreover, it is examined the patterns of the collaboration frameworks for different disciplinary knowledge; therefore, it is revealed how the frameworks can help to combine different knowledge and how it is shifted to integrated design processes from conventional design processes. In this sequence, it is mentioned the new terms popped up by the interaction between architects and engineers within the contemporary frameworks. Another question within the context of this thesis is reviewed: In recent times, how do the digital tools in the field architecture and engineering overlap and how much can they be integrated? After having been put forward the studies of Finite Element Method and its computational aspect, engineers widely started using computational finite element tools in their problem solving processes. Therefore, the information production has become rapid and accurate. Furthermore, the capabilities of the computational tools create useful information to be used as inputs for different disciplines. Hence, the information flow between disciplines become integrative and combinatorial. In this sense, it is pronounced that the digitals tools, produced for different usage, have the potentials to support the integrated design process and to attach the different disciplinary knowledge into design process environment. To better clarify the digital tools, it is gone through the topics: Geometrical representation in digital environment, finite element methods, digital tools for analysis, simulations, building information models. Taking into consideration the fact that the main layer of architectural design, which is structural layer, is the main collaborative and the most visible component of the building design. Therefore, it is conveyed the different structure types and the different classifications in this section. After focusing and discussing several structural taxonomies, it is analysed the structure examples of the building in the last sixty-year-period by focusing on the stuctural taxonomies mentioned. Considering the fact that structures are the main attraction for architects in time due to its significant role creating geometries and make them stand. The analysed examples in this section gives the direction to discuss how the designers and engineers collaborated and combined their knowledge and what kind of structure types used for the specific cases. In one section in the thesis, it is focused on computational approaches in design field specifically in structural design as one of the contemporary approaches in design. Geometry is the most important component of the structures as it contain the information for representation, analysis, and construction; therefore, geometry is disscussed focusing on the potentials and significance in structures. Furthermore, related to geometry, self organisation concept is discussed as a geometrical computational approach; in this sense, deterministic and non-deterministic approaches is focused. Moreover, it is reported the four different computational methods that have the potential to integrate the performative concepts in to design. As a compact statement, It is discussed the different computational approaches used for design of structures and revealed their potentials, roles and effects in the design process. After all the reviews and discussions, it is postulated a synthesis which is a proposal for the computational integrated design approach as a focal point of the thesis. This proposal is a synthesised model, which is framed by the topics and the ideas that are mentioned in the thesis. In the proposal, the performative values integrated to structural pattern which is composed on the given form and the structural performance data is converted into geometrical data on the double-curved surface to make the output be converged to much more optimised solution. The surface on which the pattern is formed, is analysed using the finite element methods to obtain values on the surface. After creating the performative value output, which is the one of the inputs of design process, according to the data obtained, the surface pattern is generated. In the framork of the proposed synthesis, it is revealed the distinction between deterministic approaches and non-deterministic approaches in design process. Deterministic approaches and non-deterministic approaches are two design methods used during the problem solving process in the ill-defined problems. The deterministic approach commonly used while non-deterministic approach has limited use in the architectural design. Deterministic approaches in architectural design leads the designer to arrive to concrete solutions and to produce one exact solution based on the data driven from the parameters. If no change occurs in the parameters, the solution does not change. Thus, randomness has no place in finding the final solution. It has been choosen as surface pattern type, the voronoi, to optimise a design problem. A voronoi pattern is produced on a double-curved surface as a structural element. Voronoi pattern gives the designer a chance of optimisation within the critical boundaries of structural performance. It is possible to perceive the grid, the point set, pattern structural system, and the stress map simultaneously while using the proposed model. At initial design stages, the user is able to form the pattern directly, and other components indirectly. Using the interface, user is able to control distribution and density of the control points that direct the deformation of the pattern. Thus, the user can watch all of the deformations throughout the design product. Using this approach, it is possible to create multiple solutions meeting the structural requirement The proposed model helps to construct the link between geometric and structural topics and help to remove contradiction between optimisation and generative concepts. By merging optimisation and generative concept, the paper demonstrates to extract the implicit structural and geometrical potentials of patterns as structures. Moreover, the proposed model at the initial stage of the design process offers the designer a decision support system. The solutions generated by the system converge to the optimum solution, which meets the performance requirements. Therefore, the proposed approach reduces the time spent to make the design outcome realistic. Additionally, the proposed approach boosts of generative methods by using optimisation methods and makes the design process more performance oriented. To conclude with, the designer enriches the solution set around the convergent ones to the optimum solution by the help of the embedded performance intelligence. With the proposed model, the design process becomes much more creative and innovative than before, by attaching the computational approaches and different disciplinary knowledge into the process. These tools and approaches enrich the design process making it more generative. On the other hand, integrated design approaches become more advantageous comparing the conventional design ones when producing the proposals for complex-characterised-problems. ",
    "supervisor": "Prof.Dr.Gülen Çağdaş",
    "title": "Computational design approaches : an integrated design proposal "
  },
  {
    "author": "Merve Mollamehmetoğlu, 2011",
    "keywords": " computer technologies, design education, profession tentency detection",
    "summary": "Students who prefer to have an education in any design department of the universities, making their decisions without knowing more about the subject and having enough infrastructure about design itself, because of the existing central examination system in Turkiye. This situation, raises a serious need for the adaptation process during the design education. Considering the existing educational deficiencies in Turkiye, guidance services and their application of occupational trend tests remain weak in terms of following up results. At this point, it might be right to start thinking what other alternative ways can be used, in order to identify these trends and steer students according to their tendencies. In this study, the role of game-based design software applications in improving design capability of elementary students is investigated. For this purpose, a preliminary survey was conducted in an elementary school, in order to determine the students’ relationship with the computer, how long and for which activities they are using the computer, and for to distinguish the students who wants to be a designer. According to the results of the survey, 40 students selected. After choosing the relevant game-based design software application (HomeStyler), one to one meeting has been done, and the results are evaluated. The results of the study indicates that, these kind of game-based design software applications can be used in detection of trends and areas of interests, of the elementary students. The application was appealing for the majority of the students, and they told had fun while they were learning something. All of the students interviewed stated that they want to continue to learn and work in such environments. The media, might reduce students’ anxiety, help them learn as an individual and also provides visually supported learning. ",
    "supervisor": "Lec.Dr. Hakan Tong",
    "title": "The role of computer technologies in improving design capability of elementary students"
  },
  {
    "author": "Burak Pak, 2003",
    "keywords": "",
    "summary": " For designers, visual speculations assist inventions and visual tokens most effectively represent ideas. They need sufficiently intuitive tools that allow them to use their full spectrum of their abilities and imagination. Digitalization of the design tools and design process has currently shift the conceptual thinking both in real (physical) and virtual architecture. It is also clear that the new paradigm of emerging design process is bound to electronic and digital technologies. The other fact in digitalized architecture is the base with an extremely fluid and (n) dimensioned application space. Thus, we need new and capable tools to practice in this new environment. Experimental generator (xpGEN) is a plug-in that allows user to interact with computer for experimental, intuitive and inspirational assistance during the beginning of the architectural and basic design phase by randomly generating multiple design alternatives according to the limitations of the user. The tool is actually a 3d visual speculator and does not mimic traditional design techniques. The independent user interface XpGEn was created with MAXscript scripting language in 3D Studio MAX.The main interface provides user to choose the type of generation and its parameters. The process is undoable and freed from the linear process of traditional design. The tool doesn't automate the design process. User's decision is the main concept. ",
    "supervisor": "Assoc. Prof. Dr. Arzu Erdem",
    "title": "A design model for intersection of digital media and architecture"
  },
  {
    "author": "Selen Okçu, 2003",
    "keywords": "",
    "summary": "In this study, a soft-ware was developed for furnishing process of architectural design. The living room was chosen as a pilot space and the system is programmed to generate reasonable compositions within the principals of spatial orientation. In the first part, the subject of the thesis, objectives, scope of the issues analyzed within the project, method of the study and the need for computer aided design soft wares are explained. In the second part, design problems, main concerns of architectural design and interior design; furnishing in terms of space organization are clarified. The importance of computer-based systems in design applications is mentioned. The structure of DDSS (design decision support systems) is explained in details in the third part. Computer usage that is inevitable in architectural design in recent years is examined and the definitions of computer aided architectural design, artificial intelligence (AT), expert systems (ES) are made. In the forth part, contents of AI, possibilities offered by AI and various programming languages used in AI applications are explained. In addition evaluations of some of these programs are made in order to identify their traits. Characteristic features and contents of C++ Builder environment are described; especially the elements that form graphical user interfaces and its object-oriented fashion are explained. A detailed explanation of the importance of the software developed for users and the components of the system structure conclude the fourth part. In the fifth part, all the icons on the user interface of the software and the steps that the software engine follows while generating alternatives are explained in detail. All the characteristics of the program and feasibilities offered by the program are defined. Explanations of the different application areas and the aim of the software IX\u000bare mentioned according to their importance to this process. An evaluation of the results of this software application concludes the fifth part. In the sixth and final part, general results of this master thesis are explained. Future objectives, possible additions to the software and different application areas based on these software modifications are discussed. ",
    "supervisor": "Assoc. Prof. Dr. Sinan Mert Şener",
    "title": "Software developed for living room furnishing "
  },
  {
    "author": "Mert Cığızoğlu, 2011",
    "keywords": " responsive architecture, biomimesis in architecture",
    "summary": "In this study a model proposed for buildings, which are used for hundreds of years, to enable them to respond and adapt to the chancing environmental conditions and socio-cultural requirements. In this regard, “biomimetic architecture”, which can be summarized as learning from the field testing and research of the nature; “lightweight structures” that are able to decrease dead load – live load ratio and; “responsive architecture” that enables building to respond to changing environmental conditions and user requirements are researched. Sun is defined as an agent, since its location changes during day and year, for the biomimetic responsive surface model proposed and it is intended that the decision to let the sunshine come into the building or not can be given by the surface itself in accordance with the parameters defined in its control mechanism. As a result, the responsive surface has holistic biomimetic approach and be able to respond according to the the parameters defined in its control mechanism to provide contribution for the elimination of excess cooling or heating loads of the building. The use of the model in architectural design and software related paths and processes that can be followed are also investigated in the thesis. ",
    "supervisor": "Lec.Dr. Hakan Tong",
    "title": "A model proposal for a biomimetic responsive surface design: hexa-myosis"
  },
  {
    "author": "Gürkan Özenen, 2007",
    "keywords": " interaction, database, history of architecture",
    "summary": "There have been new approaches for importance and use of information just like the improvement of the computer technology. By this way, the documented information could be transmitted form the past to the future generations. The most considerable factor of Istanbul to be selected as “European Capital of Culture” for the year 2010 is the reflection of different civilizations and architectures that has been settled in the city. This importance of the city somehow should be appreciated. The aim of this dissertation study is to analyze the past and present architecture of Istanbul that has not been emerged before. In this thesis, a database that consist the past and present architectural structures of Istanbul but especially the Historical Peninsula and Galata have been developed. These structures have been represented in historical order in this database. In conclusion, developing an initiatory interactive database for presentation of the significant architectural structures in Istanbul may be effective with the use of technological benefits. ",
    "supervisor": "Assoc.Prof.Dr. Sinan Mert Şener",
    "title": "An interactive database for architectural history of Istanbul"
  },
  {
    "author": "Ozan Önder Özener, 2003",
    "keywords": "",
    "summary": " With the tranformation of information to digital data, space phonmenea computer screens became virtual gates that opens to a paralel universe. With the extermely fluid context of Information technology, space and time emerge as new entities bound to a nonreal and artificial being. Architects and designers approach to cyberspace is an unlimited practical environment with ant relations with physical space and its rules. A new discourse has emerged and thus, morphed architecture and design theory in which the limits of every kind of physical reality can be easily exceeded and all components from medium to material can exist in a parallel code. Cyberspace as a spatial design environment faces architects with a fuzzy and multi dimensioned design problem. The purpose of study to define cyberspace and virtual medium at the intersection of cyberculture,technology and human being, as well as experiencing the virtual medium as an architectural design environment with an experimental design project IX. ",
    "supervisor": "Assoc. Prof. Dr. Arzu Erdem",
    "title": "Cyberspace textuality and an interactive 3d space model for hypertextual medium "
  },
  {
    "author": "Funda Tezel, 2007",
    "keywords": " data-base systems, architectural design education, office building",
    "summary": "The subject of our study is giving architectural design theory with the methods for analysing the design, which are supported by architectural typology, experience, abstraction and formalization, and also giving users (student, architect, academician) the chance for uploading his/her design examples to the system for sharing their data all over the world using internet connection. System is limited with the high-rise office building typology, but in the future its structure can be used for other building typologies. The written, visual and technical information that the system is contained, is used for getting information about previous examples and also used for searching the examples with the specific features that are defined in research. The system is a new example with the features which is a visual database and also a web-database application. ",
    "supervisor": "Assoc.Prof.Dr. Sinan Mert Şener",
    "title": "Web-based data support system for office buildings in architectural design education-talloffice"
  },
  {
    "author": "Ümit Aydoğan, 2006",
    "keywords": " design, computer aided design, strategy, strategic use, Auto CAD",
    "summary": "This study contains four different types of survey study which aims to mention thestrategical usage of the computer aided design programs. These surveys consist ofquestions which aim to understand that how efficient users use CAD programs(Computer Aided Design Programs) As a result of literature research; generaldefinitions like the structure and short history of the CAD programs and making groupsdue to the usage in second chapter, datasets about strategical usage of AutoCAD andstrategical usage criteria for evaluation in third chapter are mentioned. Datasetsobtained from research are explained with detailed tables and graphics in forth chapter.Finally, obstacle situations for strategical usage of CAD programs are mentioned as aresult of dataset obtained from research. Points, thought that provide possibility forelimination these impediments and efficient usage of CAD programs is defined and somesuggestion is given for the future studies. The comparison of the results with theexamples given in the literature, it is agreed that the work has unique features instrategic use of CAD systems, and has substructure for future works.",
    "supervisor": "Assoc.Prof.Dr. Sinan Mert Şener",
    "title": "Evaluating the strategic use of CAD software"
  },
  {
    "author": "Mehmet Sarper Takkeci, 2011",
    "keywords": " architecture, cooperation in architectural design, Web 2.0 technology",
    "summary": "All practices and their educational methods react to society’s structural and ideological changes. Therefore, each practice is obliged to produce new solutions to societies changing and increasing need. The context of the produced solutions extended in time and this situation caused a specialization and division of labor trend. Due to the nature specialization, collaboration becomes essential. In conjunction with the changes and evolutions in the information and communication technologies, collaboration can be accomplished in virtual environments via computers. Especially, with the aid of emerging technologies and applications, which provided the new and socially developed virtual media, collaboration becomes easier and more efficient. Like others, architecture and design disciplines adjust themselves to these developments and realizes virtual design studios as a new working and learning environment by using applications for collaboration in virtual environments. The aim and focus of this study is, to examine precessor examples of virtual design studios, thinking Web 2.0 technologies and virtual design studios together to develop a model. ",
    "supervisor": "Lec.Dr. Hakan Tong",
    "title": "Developing a model for remote architectura design education"
  },
  {
    "author": "Haluk Özcan, 2010 ",
    "keywords": " computer aided design, building information systems, information in architecture",
    "summary": "In this study, the adaptation process and the incapabilities of building information system, by means of basic architectural design while experiencing the transition between usage of conventional computer aided design method and building information modeling is examined. The handicaps being faced during this transition progress through building information modeling are obtained by implementation of a survey to the participants who experienced this change. ",
    "supervisor": "Assoc.Prof.Dr. Sinan Mert Şener",
    "title": "Building information modelling as its position in architecture"
  },
  {
    "author": "Sema Alaçam Aslan, 2008",
    "keywords": " colloboration in design, computer- human interaction, touchable user interface",
    "summary": "The aim of this study is to explore how new technology opportunities affect approaches of designers during collaborative architectural design. Within the proposed interface, this study deals with simultaneous design process of architect-designers on computer environment. The effect of novel representation and communication tools on architectural design process has been examined. Implication of proposed interface is based on two phases: taking the data input by the designer via hardware to the computer environment and the transformation of data into design product in the software by scripting addition. Within thesis study, an experiment environment with multiple input alternatives has been set up. Simultaneous usage of two mice, a graphical tablet and a three-dimensional mouse are used as physical interfaces. The data has been processed in one of the 3D Graphical User Interfaces (GUI) and transformed into basic modification and transformation commands. As a three dimensional modelling software, 3DsMax is used. This study should be considered as a beginning step for exploring the restrictions and potentials of different interfaces via expermental methods. ",
    "supervisor": "Prof.Dr.Gülen Çağdaş",
    "title": "Proposal of user interface for collaborative architectural design process"
  },
  {
    "author": "Ümit Sabri Türkcan, 2007",
    "keywords": " smart house, urban network, smart system interaction",
    "summary": "In this research, a structure of network that enables the exchange of data in and out of smart houses is explored. A model; within the context of urban network, is created by making use of the parameters derived from the smart house subsystems. The control systems inside the smart buildings are explored; in terms of user-system relationship and user-system interaction. By integrating an additional device to the smart house control systems; which carry out their roles as singular, stand-alone systems, it is possible to represent the smart house in different areas of the urban network. With the integration of this additional device, the smart house is portrayed in the urban network as having multiple representations and it is transformed in such a way that it provides data input for the urban information network. As the smart house is improved as a result of the proposal manifested in this thesis study; it will be possible for the smart house systems use their processed data more efficiently, and it will be possible for the urban network to carry out its functions in a more efficient way. ",
    "supervisor": "Assoc.Prof.Dr. Arzu Erdem",
    "title": "A conceptual model based on interaction between smart houses and urban network"
  },
  {
    "author": "Özlem Ünkap, 2006",
    "keywords": " virtual studio, cyberspace, architecture education, design studio",
    "summary": "The effective use of information technologies in architecture causes several changes like the definition of architecture, design concept, professional application and architectural design education. Developing information technologies affects physical architecture as well as cyberspace architecture which exist on the other side of the computer screen. Architecture has a key role in evolution of cyberspace. The purpose of this study is to examine the relationship between virtual architecture and architectural design education, virtual studio applications in architectural design and to discuss the place of virtual architecture in future of architectural education. This study consists of four chapters. In the first chapter, purpose, scope and borders of the thesis are clarified. In the second chapter, cyberspace, which is the presence place of virtual architecture, is defined according to contemporary theories. Contemporary approaches for virtual architecture are stated and architectural examples situated in cyberspace are examined. Virtual architecture is a brand new concept in architectural discipline and does not have clear definition borders; therefore it is perceived and applied in many different ways. The stated approaches in the second chapter are chosen for examining the studies stated in the third chapter. In the third chapter, virtual studio applications from universities are described and examined according to contemporary approaches stated in the second chapter. In the last chapter, the place of virtual architecture in architectural design studio is estimated. Forecasts about the future of architectural design studio and integration suggestions about virtual architecture are cited. ",
    "supervisor": "Assoc.Prof.Dr. Arzu Erdem",
    "title": "An evaluation of virtual studıo applications in architectural design"
  },
  {
    "author": "Eda Kevser Gür, 2014",
    "keywords": " augmented reality, architectural design practice, application, glass",
    "summary": "Architectural design construction process is a complicated system which customer, architect and other expert attends that encompasses a variety of disciplines and services together. This process is a combination of related services that is essential to produce the end product of architectural design, the building. Any weakness occurs during the control of such services will eventually affect the overall construction process. The customers involved in the construction process have to deal with the problems related to the marketing and purchasing like understanding the project, on the other hand the architects deal with project and technical issues related to manufacturing and construction problems. These problems can be mostly seen in the housing development projects, in which the expectations and personal taste of the customers come front. In order to determine the problems in the construction of architectural design as well as the areas such problems clustered in, it has been aimed to gain data from technical experts and the staff of sales offices. During the construction phase of the work done in 2 dimensional environment that will actually produce 3 dimensional structure build, design and manufacturing for the tracking of all data in terms of both customers and architects is a significant problem. In today’s world, supportive applications based on mobile devices have been developed with the help of advanced technology special to the architecture profession likewise the many other disciplines. In this period of rapid acceleration of technology studies supported by the computer based systems have become a necessity. In this thesis, the proposed solution for the issues of architectural design application is based on Augmented Reality, which is one of the recent methods developed in parallel to the advancement in technology. ",
    "supervisor": "Lec.Dr. Hakan Tong",
    "title": "A model based on assessment of architectural design process of augmented reality "
  },
  {
    "author": "Erinç Onbay, 2006",
    "keywords": " mass production, mass personalization, smart houses, computer aided architectural design",
    "summary": "In this study, the transformation of ‘house of the future’ prototypes that emerge according to differentiating conditions in every period, within the developments in information technologies, are analyzed, especially from the 1930 s that accepted as Industrial Age to the present day which is defined as Information or Post-Information Age. The attempts to fulfill the demand of housing by means of mass-production since 1930’s, caused the emergence of the monotonous environments and to prevent monotony, fantastic designs which could not be accepted by society were recommended. In 1980’s, ‘smart houses’ which are automated to handle the household chores has appeared. But the problems associated with the programming hindered this technology to be widespread. By the 1990’s, while computer aided design and production techniques allow designers to create objects with unique and complex forms economically, the concept of ‘mass-customization’ which is developed instead of ‘mass-production’, changed the way of imagining ‘house of the future’. Today, the ‘house of the future’ prototypes generated in the academic environments are designed as interactive environments that recognize the user by sensors and fulfill the demands of him/her. Within the developments of information technologies, different meanings have already been added to the housing space. Like the ‘home office’ concept brought by the Internet, shopping, entertainment, education and health services will be accessible through the house in the near future. ‘House of the future’ will turn out to be ‘a prothesis that is carrying the flow of information to the human body’, ‘not only a limitator for the space but also an envrionment provider for the technology’, and ‘an industrial product that is designed and personalized by the user’. ",
    "supervisor": "Assist.Prof.Dr. Meltem Aksoy",
    "title": "The transformation of ‘house of the future’ within the developments in information technologies"
  },
  {
    "author": "Hande Karakaş, 2015",
    "keywords": "",
    "summary": "",
    "supervisor": "",
    "title": "Hearing Blocks: A Synesthetic Spatial System for Children"
  },
  {
    "author": "Mehmet Emin Bayraktar, 2010 ",
    "keywords": " computer aided design, agent, multiple agent based systems",
    "summary": "In this study a space configuration tool based on user movements has been developed. This study takes advantage of agent based model frame. In this research there are sections such as; artificial intelligence and its application fields, agent definition, types and properties, architectural space definition, representation methods, architectural drawings and diagrammatic representation subjects. As a result of these topics, “İz-Mekan” (Trail-Space) is developed which is a space configuration tool. It is expected that architects and architectural students will use this model. Its originating point is creating dynamic representation of living spaces and developing a tool using this approach. As computers take important role in architectural design studies, different methods can be developed seperate from conventional representations. Representation techniques, diagrams, user movements and agents affect this new made tool considering computer aided architectural design with mentioned subjects. This study is an experimental work, it is a pre-research phase with aim of building new digital architectural design tools in the future by the writer. ",
    "supervisor": "Prof.Dr. Gülen Çağdaş",
    "title": "Space Configuration with user movements: an agent based design tool"
  }
]